README.org
#+TITLE: My literate EMACS config

#+STARTUP: content
#+PROPERTY: header-args:emacs-lisp :tangle init.el

#+SETUPFILE: ./theme-readtheorg.setup
#+EXPORT_FILE_NAME: index.html

#+AUTO_TANGLE: t

Welcome to my detailed literate [[https://www.gnu.org/software/emacs/][EMACS]] (Editor for Middle-Aged Computer
Scientists) configuration!

I'm using EMACS for several years now and I have tried multiple
different ways of adopting it. I started with [[https://spacemacs.org/][Spacemacs]]. Then I tried
to write my own configuration framework. Also I had multiple attempts
to write configuration from scratch (like here). I tried to give up
and use VSCode, but it was too late for me and I returned to EMACS. I
used [[https://github.com/doomemacs/doomemacs][DOOM EMACS]] for around a year or more and it is still my favourite
distribution. If you looking for Vim-style EMACS distribution I highly
recommend to try DOOM EMACS. But I found that I want to have more
control over my configuration and it's more rewarding for me to write
it from scratch. So I'm here again. And this time I feel that I
finally discovered the approach that fits me the best. And I'm happy
to share it with you!

Composed in [[https://orgmode.org/][ORG mode]], this document amalgamates both configuration
code and reasoning behind. Most of the code is [[https://orgmode.org/manual/Extracting-Source-Code.html][tangled]] into the
~init.el~ file, with some exceptions (~early-init.el~, ~templates.eld~
for example). A helpful feature from [[https://github.com/yilkalargaw/org-auto-tangle][Org Auto-Tangle]] automatically
regenerates all files whenever this document is modified and saved.

Several essential aspects of my configuration are not Elisp code, but
[[https://nixos.org/][Nix]] code for [[https://github.com/nix-community/home-manager][Home Manager]]. I keep it in [[https://github.com/ffloyd/nix][a separate repository]] and all
EMACS-related configration is stored in [[https://github.com/ffloyd/nix/blob/main/hm/emacs.nix][the separate module]].

The document structure consists of three primary sections, each is a
high-level configuration goal. Relevant configurations are grouped
together under subsections. When possible I name subsections with the
focus on user behaviours and experience rather than technical details.

All functions, variables and modes that are defined in this document
are prefixed with ~my-~ to avoid conflicts with other packages.

I do not use lazy loading in this configuration. Modern machines are
fast enough to load everything at startup. So I decided to avoid all
the complexity that heavy usage of lazy loading introduces.

This config primarily focuses on configuring EMACS for MacOS
environment, but from time to time I make it more adjusted for my
NixOS setup.

* Make it a decent configurable editor
Vanilla EMACS doesn't act and look like a modern editor out of the
box. This section focuses on making it more user-friendly and visually
appealing. In addition, it includes some configuration helpers to
simplify configuration process in the later sections.

The last subsection in this section is dedicated to /leader/
keybindings. Other keybindings are defined in the corresponding
subsections.

** It should be obvious that /generated files/ must not be edited
Disclaimer for ~early-init.el~:

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;; WARNING!
;;
;; This file is a result of `org-babel-tangle` execution on `.emacs.d/README.org`.
;; Don't change it manually.
#+END_SRC

Disclaimer for ~init.el~:

#+BEGIN_SRC emacs-lisp
;; WARNING!
;;
;; This file is a result of `org-babel-tangle` execution on `.emacs.d/README.org`.
;; Don't change it manually.
#+END_SRC

Disclaimer for ~templates.eld~:

#+BEGIN_SRC lisp-data :tangle templates.eld
;; WARNING!
;;
;; This file is a result of `org-babel-tangle` execution on `.emacs.d/README.org`.
;; Don't change it manually.
#+END_SRC

