README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-19 Sun 19:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My literate EMACS config</title>
<meta name="author" content="Roman Kolesnev" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">My literate EMACS config</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge06220f">1. Make it a decent configurable editor</a>
<ul>
<li><a href="#orge4d91f3">1.1. It should be obvious that <i>generated files</i> must not be edited</a></li>
<li><a href="#orgafc6abb">1.2. Improve <i>native compilation</i> expiriense</a></li>
<li><a href="#org425b635">1.3. Improve <i>package</i> management experience</a></li>
<li><a href="#orgb21789e">1.4. Writing <i>elisp</i> functions should be convinient</a></li>
<li><a href="#orgf5b4604">1.5. Optimize default <i>limits</i> for modern hardware</a></li>
<li><a href="#orge2423e6">1.6. <i>Built-in features</i> that should be enabled by default</a></li>
<li><a href="#org2647f9c">1.7. Better organization of <i>auxiliary files</i></a></li>
<li><a href="#orge223f6e">1.8. It should <i>look</i> modern and comfortable</a></li>
<li><a href="#org0bda69b">1.9. Improve keybinding management with focus on <i>VIM</i> editing style</a></li>
<li><a href="#orgcdfe9ea">1.10. Adjust keybindings to <i>MacOS</i></a></li>
<li><a href="#org031f892">1.11. Improve integration with <i>clipboard</i></a></li>
<li><a href="#org17984a5">1.12. Load shell <i>environment</i> variables</a></li>
<li><a href="#orgd85c959">1.13. Improve <i>minibuffer completion</i> experience</a></li>
<li><a href="#orgc068804">1.14. Improve <i>ediff</i> experience</a></li>
<li><a href="#orgf7e9772">1.15. Improve <i>dired</i> experience</a></li>
<li><a href="#org1ddbd1c">1.16. Improve <i>ibuffer</i> experience</a></li>
<li><a href="#orgae2105e">1.17. Improve <i>internal help</i> system</a></li>
<li><a href="#org403656f">1.18. Fix confusing <i>buffer naming</i> when working with files with the same name</a></li>
<li><a href="#org9e54d84">1.19. Improve <i>buffer killing</i> flow</a></li>
<li><a href="#org65ee3fb">1.20. Fast jumps between <i>distant places</i> in buffer</a></li>
<li><a href="#org449f94b">1.21. Improve <i>window splitting</i> behaviour</a></li>
<li><a href="#org516aabe">1.22. Fast jumping between <i>distant windows</i></a></li>
<li><a href="#orge229960">1.23. Be able to keep multiple <i>window layouts</i> open</a></li>
<li><a href="#org2b2330c">1.24. Improve <i>text scaling</i> flow</a></li>
<li><a href="#orga0a9440">1.25. Relative <i>line numbers</i> by default, absolute on demand</a></li>
<li><a href="#org385c64e">1.26. <i>Do not show</i> non-informative minor modes <i>in modeline</i></a></li>
<li><a href="#org1a5f551">1.27. Use spaces for <i>identation</i></a></li>
<li><a href="#org10ab012">1.28. Automatically add <i>newline</i> at the end of the file</a></li>
<li><a href="#org27f832d">1.29. Handle situation when too many <i>file watches</i> are added</a></li>
<li><a href="#org727ea6e">1.30. Distiguish between different pairs of <i>delimiters</i></a></li>
<li><a href="#org614277c">1.31. Deal with <i>pairs</i> smarter</a></li>
<li><a href="#org9adfdc2">1.32. Make <i>regular expessions</i> in this config more readable</a></li>
<li><a href="#org4182a26">1.33. Open files in <i>existing instance</i> of EMACS</a></li>
<li><a href="#org708f88a">1.34. Define basic leader <i>keybindings</i></a></li>
</ul>
</li>
<li><a href="#org9e43688">2. Make it an IDE</a>
<ul>
<li><a href="#orge37bce8">2.1. <i>Project</i> management and search</a></li>
<li><a href="#org2cdd254">2.2. Fast access to <i>favourite files</i></a></li>
<li><a href="#org4702652">2.3. <i>Git</i> support</a></li>
<li><a href="#orge2a5487">2.4. <i>Terminal</i> support</a></li>
<li><a href="#org40b8d45">2.5. Enable <i>autocompletion</i></a></li>
<li><a href="#org7df407f">2.6. Enable <i>snippets</i></a></li>
<li><a href="#org361dfc4">2.7. Enable <i>Language Server</i> support</a></li>
<li><a href="#org36de831">2.8. Retrieve secrets from <i>passwod manager</i></a></li>
<li><a href="#org9d6020a">2.9. Opt-in switch to <i>GitHub Copilot</i> completion</a></li>
<li><a href="#orgcbf5966">2.10. Get assistance from <i>LLMs</i></a></li>
<li><a href="#orge5562bd">2.11. <i>REST</i> client</a></li>
<li><a href="#org2a74a5b">2.12. Support <i>direnv</i> environments</a></li>
<li><a href="#orgc3a2247">2.13. Open fancy <i>dashboard</i> on startup</a></li>
</ul>
</li>
<li><a href="#org94e3a22">3. Make it work with&#x2026;</a>
<ul>
<li><a href="#org8c86a26">3.1. Nix</a></li>
<li><a href="#org9b768a0">3.2. Elixir</a></li>
<li><a href="#orgb486db2">3.3. EMACS Lisp</a></li>
<li><a href="#orgec484d4">3.4. Ruby</a></li>
<li><a href="#org1e9d8bf">3.5. JSON</a></li>
<li><a href="#org1bd2e8e">3.6. YAML</a></li>
<li><a href="#orgff20be5">3.7. ORG</a></li>
<li><a href="#orgc37dca5">3.8. Markdown</a></li>
<li><a href="#orgd93c2bd">3.9. Docker</a></li>
<li><a href="#orga06b782">3.10. Earthly</a></li>
<li><a href="#orgd940d63">3.11. Terrafrom</a></li>
<li><a href="#orgd25a69d">3.12. Go</a></li>
<li><a href="#org9c4f710">3.13. Python</a></li>
<li><a href="#orgc77023e">3.14. Mastodon</a></li>
<li><a href="#orgc6cbe15">3.15. JS/TS(X)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Welcome to my detailed literate <a href="https://www.gnu.org/software/emacs/">EMACS</a> (Editor for Middle-Aged Computer
Scientists) configuration!
</p>

<p>
I'm using EMACS for several years now and I have tried multiple
different ways of adopting it. I started with <a href="https://spacemacs.org/">Spacemacs</a>. Then I tried
to write my own configuration framework. Also I had multiple attempts
to write configuration from scratch (like here). I tried to give up
and use VSCode, but it was too late for me and I returned to EMACS. I
used <a href="https://github.com/doomemacs/doomemacs">DOOM EMACS</a> for around a year or more and it is still my favourite
distribution. If you looking for Vim-style EMACS distribution I highly
recommend to try DOOM EMACS. But I found that I want to have more
control over my configuration and it's more rewarding for me to write
it from scratch. So I'm here again. And this time I feel that I
finally discovered the approach that fits me the best. And I'm happy
to share it with you!
</p>

<p>
Composed in <a href="https://orgmode.org/">ORG mode</a>, this document amalgamates both configuration
code and reasoning behind. Most of the code is <a href="https://orgmode.org/manual/Extracting-Source-Code.html">tangled</a> into the
<code>init.el</code> file, with some exceptions (<code>early-init.el</code>, <code>templates.eld</code>
for example). A helpful feature from <a href="https://github.com/yilkalargaw/org-auto-tangle">Org Auto-Tangle</a> automatically
regenerates all files whenever this document is modified and saved.
</p>

<p>
Several essential aspects of my configuration are not Elisp code, but
<a href="https://nixos.org/">Nix</a> code for <a href="https://github.com/nix-community/home-manager">Home Manager</a>. I keep it in <a href="https://github.com/ffloyd/nix">a separate repository</a> and all
EMACS-related configration is stored in <a href="https://github.com/ffloyd/nix/blob/main/hm/emacs.nix">the separate module</a>.
</p>

<p>
The document structure consists of three primary sections, each is a
high-level configuration goal. Relevant configurations are grouped
together under subsections. When possible I name subsections with the
focus on user behaviours and experience rather than technical details.
</p>

<p>
All functions, variables and modes that are defined in this document
are prefixed with <code>my-</code> to avoid conflicts with other packages.
</p>

<p>
I do not use lazy loading in this configuration. Modern machines are
fast enough to load everything at startup. So I decided to avoid all
the complexity that heavy usage of lazy loading introduces.
</p>

<p>
This config primarily focuses on configuring EMACS for MacOS
environment, but from time to time I make it more adjusted for my
NixOS setup.
</p>
<div id="outline-container-orge06220f" class="outline-2">
<h2 id="orge06220f"><span class="section-number-2">1.</span> Make it a decent configurable editor</h2>
<div class="outline-text-2" id="text-1">
<p>
Vanilla EMACS doesn't act and look like a modern editor out of the
box. This section focuses on making it more user-friendly and visually
appealing. In addition, it includes some configuration helpers to
simplify configuration process in the later sections.
</p>

<p>
The last subsection in this section is dedicated to <i>leader</i>
keybindings. Other keybindings are defined in the corresponding
subsections.
</p>
</div>
<div id="outline-container-orge4d91f3" class="outline-3">
<h3 id="orge4d91f3"><span class="section-number-3">1.1.</span> It should be obvious that <i>generated files</i> must not be edited</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Disclaimer for <code>early-init.el</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">WARNING!</span>
<span style="color: #616e88;">;;</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">This file is a result of `org-babel-tangle` execution on `.emacs.d/README.org`.</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">Don't change it manually.</span>
</pre>
</div>

<p>
Disclaimer for <code>init.el</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">WARNING!</span>
<span style="color: #616e88;">;;</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">This file is a result of `org-babel-tangle` execution on `.emacs.d/README.org`.</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">Don't change it manually.</span>
</pre>
</div>

<p>
Disclaimer for <code>templates.eld</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp-data"><span style="color: #616e88;">;; </span><span style="color: #616e88;">WARNING!</span>
<span style="color: #616e88;">;;</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">This file is a result of `org-babel-tangle` execution on `.emacs.d/README.org`.</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">Don't change it manually.</span>
</pre>
</div>
</div>
</div>
