README.org
** Improve /native compilation/ expiriense
Native compilation can provide a signifiant speedup and enabled by
deafult in modern EMACS versions, but I don't want to see native
compilation warnings because in the most cases it's just distraction:

#+BEGIN_SRC emacs-lisp
(setq native-comp-async-report-warnings-errors nil)
#+END_SRC

** Improve /package/ management experience
This config uses [[https://github.com/raxod502/straight.el][straight.el]] for downloading packages instead of
~package.el~ (which is part of EMACS). ~straight~ does git checkouts
instead of archive downloads. It leads to better discoverability,
simplifies patching and contributing to downloaded packages. Also it
allows to use lockfiles that enables reproducible builds.

I disable standard packaging system in ~early-init.el~. It is a bit
more natural than disabling it in ~init.el~. Also I instructing EMACS
to load newer files when alternatives exist. It is something that
works better when set early.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(setq package-enable-at-startup nil)
(setq load-prefer-newer t)
#+END_SRC

To enable ~straight~ I need to copy-paste this bootstraping code from
~straight~'s [[https://github.com/radian-software/straight.el?tab=readme-ov-file#bootstrapping-straightel][README]]:

#+BEGIN_SRC emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+END_SRC

I tried different options for package configuration management:
[[https://github.com/jwiegley/use-package][use-package]], [[https://github.com/conao3/leaf.el][leaf]] and custom helpers. ~use-package~ is a standard
configuration macro now, it even became part of EMACS. ~leaf~ is its
alternative: cleaner, easier to extend, but adoption in community is
relatively low (to be honest, I'd prefer ~leaf~ to be part of EMACS,
not ~use-package~). But both of them hide configuration details and
focus on configuring packages rather than configuring features (one
package can be used to address multiple features, one feature can be
implemented via multiple packages). That's why I decided to use a set
of small custom helpers and avoid ~use-package~ or ~leaf~.

#+BEGIN_SRC emacs-lisp
;; NO HELPERS YET
#+END_SRC

[[https://orgmode.org/][ORG]] should be loaded as early as possible to avoid conflicts with
preinstalled ORG:

#+BEGIN_SRC emacs-lisp
(straight-use-package 'org)
(require 'org)
#+END_SRC

** Writing /elisp/ functions should be convinient
"Missing parts of the language": libraries that are used by majority
of developers.

[[https://github.com/magnars/dash.el][List transformations]]:

#+BEGIN_SRC emacs-lisp
(straight-use-package 'dash)
(require 'dash)
#+END_SRC

[[https://github.com/rejeep/f.el][File operations]]:

#+BEGIN_SRC emacs-lisp
(straight-use-package 'f)
(require 'f)
#+END_SRC

[[https://github.com/magnars/s.el][String manipulations]]:

#+BEGIN_SRC emacs-lisp
(straight-use-package 's)
(require 's)
#+END_SRC

** Optimize default /limits/ for modern hardware
Default Garbage Collector behaviour and limits are too aggressive for
modern PCs and can lead to freezes. [[https://github.com/emacsmirror/gcmh][Garbage Collector Magic Hack]]
library introduces adaptive approach to GC. It's better to enable it
early.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'gcmh)
(require 'gcmh)
(gcmh-mode 1)
#+END_SRC

Some libraries like ~lsp~ or ~eglot~ have to work with external
processes that produce a lot of output. By default EMACS has a way too
low limit for process output.

#+BEGIN_SRC emacs-lisp
(setq read-process-output-max (* 1024 1024))
#+END_SRC

Some other default limits in EMACS are also unnecessary low:

#+BEGIN_SRC emacs-lisp
(setq undo-limit (* 80 1000 1000)
      recentf-max-saved-items 1000)
#+END_SRC

