README.html
<div id="outline-container-orgafc6abb" class="outline-3">
<h3 id="orgafc6abb"><span class="section-number-3">1.2.</span> Improve <i>native compilation</i> expiriense</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Native compilation can provide a signifiant speedup and enabled by
deafult in modern EMACS versions, but I don't want to see native
compilation warnings because in the most cases it's just distraction:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> native-comp-async-report-warnings-errors nil<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org425b635" class="outline-3">
<h3 id="org425b635"><span class="section-number-3">1.3.</span> Improve <i>package</i> management experience</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This config uses <a href="https://github.com/raxod502/straight.el">straight.el</a> for downloading packages instead of
<code>package.el</code> (which is part of EMACS). <code>straight</code> does git checkouts
instead of archive downloads. It leads to better discoverability,
simplifies patching and contributing to downloaded packages. Also it
allows to use lockfiles that enables reproducible builds.
</p>

<p>
I disable standard packaging system in <code>early-init.el</code>. It is a bit
more natural than disabling it in <code>init.el</code>. Also I instructing EMACS
to load newer files when alternatives exist. It is something that
works better when set early.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> package-enable-at-startup nil<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> load-prefer-newer t<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
To enable <code>straight</code> I need to copy-paste this bootstraping code from
<code>straight</code>'s <a href="https://github.com/radian-software/straight.el?tab=readme-ov-file#bootstrapping-straightel">README</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defvar</span> <span style="color: #D8DEE9;">bootstrap-version</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">let</span> <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">(</span>bootstrap-file
       <span style="color: #5E81AC;">(</span>expand-file-name <span style="color: #A3BE8C;">"straight/repos/straight.el/bootstrap.el"</span> user-emacs-directory<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
      <span style="color: #81A1C1;">(</span>bootstrap-version 5<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">unless</span> <span style="color: #81A1C1;">(</span>file-exists-p bootstrap-file<span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">with-current-buffer</span>
        <span style="color: #5E81AC;">(</span>url-retrieve-synchronously
         <span style="color: #A3BE8C;">"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"</span>
         'silent 'inhibit-cookies<span style="color: #5E81AC;">)</span>
      <span style="color: #5E81AC;">(</span>goto-char <span style="color: #D08770;">(</span>point-max<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
      <span style="color: #5E81AC;">(</span>eval-print-last-sexp<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>load bootstrap-file nil 'nomessage<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
I tried different options for package configuration management:
<a href="https://github.com/jwiegley/use-package">use-package</a>, <a href="https://github.com/conao3/leaf.el">leaf</a> and custom helpers. <code>use-package</code> is a standard
configuration macro now, it even became part of EMACS. <code>leaf</code> is its
alternative: cleaner, easier to extend, but adoption in community is
relatively low (to be honest, I'd prefer <code>leaf</code> to be part of EMACS,
not <code>use-package</code>). But both of them hide configuration details and
focus on configuring packages rather than configuring features (one
package can be used to address multiple features, one feature can be
implemented via multiple packages). That's why I decided to use a set
of small custom helpers and avoid <code>use-package</code> or <code>leaf</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">NO HELPERS YET</span>
</pre>
</div>

<p>
<a href="https://orgmode.org/">ORG</a> should be loaded as early as possible to avoid conflicts with
preinstalled ORG:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'org<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">org</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb21789e" class="outline-3">
<h3 id="orgb21789e"><span class="section-number-3">1.4.</span> Writing <i>elisp</i> functions should be convinient</h3>
<div class="outline-text-3" id="text-1-4">
<p>
"Missing parts of the language": libraries that are used by majority
of developers.
</p>

<p>
<a href="https://github.com/magnars/dash.el">List transformations</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'dash<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">dash</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<a href="https://github.com/rejeep/f.el">File operations</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'f<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">f</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<a href="https://github.com/magnars/s.el">String manipulations</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 's<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">s</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf5b4604" class="outline-3">
<h3 id="orgf5b4604"><span class="section-number-3">1.5.</span> Optimize default <i>limits</i> for modern hardware</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Default Garbage Collector behaviour and limits are too aggressive for
modern PCs and can lead to freezes. <a href="https://github.com/emacsmirror/gcmh">Garbage Collector Magic Hack</a>
library introduces adaptive approach to GC. It's better to enable it
early.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'gcmh<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">gcmh</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>gcmh-mode 1<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Some libraries like <code>lsp</code> or <code>eglot</code> have to work with external
processes that produce a lot of output. By default EMACS has a way too
low limit for process output.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> read-process-output-max <span style="color: #88C0D0;">(</span>* 1024 1024<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Some other default limits in EMACS are also unnecessary low:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> undo-limit <span style="color: #88C0D0;">(</span>* 80 1000 1000<span style="color: #88C0D0;">)</span>
      recentf-max-saved-items 1000<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
