README.org
** /Built-in features/ that should be enabled by default
A lot of really useful EMACS behaviours are disabled by default.

#+BEGIN_SRC emacs-lisp
;; when you visit a file, point goes to the last place where it was
;; when you previously visited the same file
(save-place-mode 1)

;; saves minibuffer history (use M-p/n in minibuffer)
(savehist-mode 1)

;; visualization of matching parens
(show-paren-mode 1)

;; typing an open parenthesis automatically inserts the corresponding
;; closing parenthesis
(electric-pair-mode 1)

;; allows to 'undo' window configuration changes
(winner-mode 1)

;; word-based commands stop inside symbols with mixed uppercase and
;; lowercase letters, e.g. "GtkWidget", "EmacsFrameClass",
;; "NSGraphicsContext".
(global-subword-mode 1)

;; keeping track of opened files
(require 'recentf)
#+END_SRC

** Better organization of /auxiliary files/
[[https://github.com/emacscollective/no-littering][no-littering]] is an awesome package that organizes many "technical"
files into ~.emacs.d/etc~ and ~.emacs.d/var~ folders. The package
should be loaded as early as possible.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'no-littering)
(require 'no-littering)

;; I'm ok with security risks here but before you do this, make sure
;; you understand the risks and read the documentation of
;; no-littering-theme-backups for details
(no-littering-theme-backups) 
#+END_SRC

I prefer to store local customizations file under ~etc~ folder.

#+BEGIN_SRC emacs-lisp
(setq custom-file (no-littering-expand-etc-file-name "custom.el"))
#+END_SRC

I do not need lockfiles: I never open the same file in multiple EMACS
instances.

#+BEGIN_SRC emacs-lisp
(setq create-lockfiles nil)
#+END_SRC

It's a good idea to exclude ~etc~ and ~var~ folders from ~recentf~
results.

#+BEGIN_SRC emacs-lisp
(add-to-list 'recentf-exclude no-littering-etc-directory)
(add-to-list 'recentf-exclude no-littering-var-directory)
#+END_SRC

Native compilation cache location can be adjusted in ~early-init.el~.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(when (fboundp 'startup-redirect-eln-cache)
  (startup-redirect-eln-cache
   (convert-standard-filename
    (expand-file-name  "var/eln-cache/" user-emacs-directory))))
#+END_SRC

