README.html
<div id="outline-container-orge2423e6" class="outline-3">
<h3 id="orge2423e6"><span class="section-number-3">1.6.</span> <i>Built-in features</i> that should be enabled by default</h3>
<div class="outline-text-3" id="text-1-6">
<p>
A lot of really useful EMACS behaviours are disabled by default.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">when you visit a file, point goes to the last place where it was</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">when you previously visited the same file</span>
<span style="color: #8FBCBB;">(</span>save-place-mode 1<span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">saves minibuffer history (use M-p/n in minibuffer)</span>
<span style="color: #8FBCBB;">(</span>savehist-mode 1<span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">visualization of matching parens</span>
<span style="color: #8FBCBB;">(</span>show-paren-mode 1<span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">typing an open parenthesis automatically inserts the corresponding</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">closing parenthesis</span>
<span style="color: #8FBCBB;">(</span>electric-pair-mode 1<span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">allows to '</span><span style="color: #81A1C1;">undo</span><span style="color: #616e88;">' window configuration changes</span>
<span style="color: #8FBCBB;">(</span>winner-mode 1<span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">word-based commands stop inside symbols with mixed uppercase and</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">lowercase letters, e.g. "GtkWidget", "EmacsFrameClass",</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">"NSGraphicsContext".</span>
<span style="color: #8FBCBB;">(</span>global-subword-mode 1<span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">keeping track of opened files</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">recentf</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2647f9c" class="outline-3">
<h3 id="org2647f9c"><span class="section-number-3">1.7.</span> Better organization of <i>auxiliary files</i></h3>
<div class="outline-text-3" id="text-1-7">
<p>
<a href="https://github.com/emacscollective/no-littering">no-littering</a> is an awesome package that organizes many "technical"
files into <code>.emacs.d/etc</code> and <code>.emacs.d/var</code> folders. The package
should be loaded as early as possible.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'no-littering<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">no-littering</span><span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">I'm ok with security risks here but before you do this, make sure</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">you understand the risks and read the documentation of</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">no-littering-theme-backups for details</span>
<span style="color: #8FBCBB;">(</span>no-littering-theme-backups<span style="color: #8FBCBB;">)</span> 
</pre>
</div>

<p>
I prefer to store local customizations file under <code>etc</code> folder.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> custom-file <span style="color: #88C0D0;">(</span>no-littering-expand-etc-file-name <span style="color: #A3BE8C;">"custom.el"</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
I do not need lockfiles: I never open the same file in multiple EMACS
instances.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> create-lockfiles nil<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
It's a good idea to exclude <code>etc</code> and <code>var</code> folders from <code>recentf</code>
results.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>add-to-list 'recentf-exclude no-littering-etc-directory<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-to-list 'recentf-exclude no-littering-var-directory<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Native compilation cache location can be adjusted in <code>early-init.el</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">when</span> <span style="color: #88C0D0;">(</span>fboundp 'startup-redirect-eln-cache<span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>startup-redirect-eln-cache
   <span style="color: #81A1C1;">(</span>convert-standard-filename
    <span style="color: #5E81AC;">(</span>expand-file-name  <span style="color: #A3BE8C;">"var/eln-cache/"</span> user-emacs-directory<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
