README.org
** It should /look/ modern and comfortable
This subsection should be placed as early as possible to avoid
blinking on startup.

Disable UI elements nobody interested in:

#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(scroll-bar-mode -1)
(horizontal-scroll-bar-mode -1)

;; disabling menu-bar-mode on MacOS leads to incorrect
;; window maximization behaviour
(unless (eq system-type 'darwin)
  (menu-bar-mode -1))
#+END_SRC

[[https://typeof.net/Iosevka/][Iosevka]] is my favourite font:

#+BEGIN_SRC emacs-lisp
(let* ((family "Iosevka SS10")
       (size (if (eq system-type 'darwin)
                 18 ;; on MacOS HiDPI scaling works out of the box
               26)) ;; in Gnome HiDPI scaling doesn't work properly
       (spec (font-spec :family family :size size :weight 'semi-light)))
  (set-face-attribute 'default nil :font spec)
  ;; fixed-pitch was set to "Monospace" font by default
  (set-face-attribute 'fixed-pitch nil :family family)
  ;; variable-pitch was is set "non-monospace" font by default
  (set-face-attribute 'variable-pitch nil :family family))
#+END_SRC

[[https://www.nordtheme.com/][Nord]] is my favourite theme:

#+BEGIN_SRC emacs-lisp
(straight-use-package 'nord-theme)
(require 'nord-theme)
(load-theme 'nord t)
#+END_SRC

But it has some missing parts and some parts are designed in a way I
do not like. Let's fix it! Unfortunately I haven't realized how to use
~custom-theme-set-faces~ here so I merely update global face
settings. While I do not need secondary theme it's good enbough for
me.

[[https://www.nordtheme.com/docs/colors-and-palettes][Nord palletes]] are used here for colors when applicable.

Related issues:
- [[https://github.com/nordtheme/emacs/issues/105][Missing tab bar colors]]

#+BEGIN_SRC emacs-lisp
(let ((nord0 "#2E3440")
      (nord1 "#3B4252")
      (nord3 "#4C566A")
      (nord9 "#81A1C1")
      (nord10 "#5E81AC"))
  (custom-set-faces
   `(tab-bar ((t (:background ,nord1))))
   `(tab-bar-tab ((t (:background ,nord0
                                  :weight bold
                                  :box (:line-width -1 :style released-button)))))
   `(tab-bar-tab-inactive ((t (:foreground "gray39"
                                           :background ,nord1))))

   `(org-block ((t (:inherit org-block :background ,nord1))))
   `(org-headline-done ((t (:inherit org-headline-done :foreground ,nord10))))
   ))
#+END_SRC

Unfortunately, it's pretty common that some interfaces from 3rd-party
libraries are not styled properly or look ugly. To fix it I need to
know which exact faces look ugly. ~describe-face~ is a great tool to
find out what face is used for a particular element, but invoking it
each time is annoying. So I wrote a minor mode that shows face under
current cursor position in the minibuffer.

#+BEGIN_SRC emacs-lisp
(defun my-what-the-face ()
  "Show face under point in the minibuffer."
  (interactive)
  (let ((face (get-char-property (point) 'face)))
    (if face
        (message "Face: %s" face)
      (message "No face at point"))))

(defvar my-what-the-face-last-point nil
  "Last point where face was described.")

(defun my-what-the-face-adviced ()
  "Show face under point in the minibuffer. (Only once after point change)"
  (unless (equal my-what-the-face-last-point (point))
    (setq my-what-the-face-last-point (point))
    (my-what-the-face)))

(define-minor-mode my-what-the-face-mode
  "Minor mode to show face under point when cursor is moved."
  :global t
  :lighter " WTFace"
  (if my-what-the-face-mode
      (add-hook 'post-command-hook #'my-what-the-face-adviced 0 t)
        (remove-hook 'post-command-hook #'my-what-the-face-adviced t)))
#+END_SRC

/Visible bell/ is super-distracting and scary (especilly in the
night).

#+BEGIN_SRC emacs-lisp
(setq visible-bell nil)
#+END_SRC

