README.html
<div id="outline-container-orge223f6e" class="outline-3">
<h3 id="orge223f6e"><span class="section-number-3">1.8.</span> It should <i>look</i> modern and comfortable</h3>
<div class="outline-text-3" id="text-1-8">
<p>
This subsection should be placed as early as possible to avoid
blinking on startup.
</p>

<p>
Disable UI elements nobody interested in:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>tool-bar-mode -1<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>scroll-bar-mode -1<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>horizontal-scroll-bar-mode -1<span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">disabling menu-bar-mode on MacOS leads to incorrect</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">window maximization behaviour</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">unless</span> <span style="color: #88C0D0;">(</span>eq system-type 'darwin<span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>menu-bar-mode -1<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<a href="https://typeof.net/Iosevka/">Iosevka</a> is my favourite font:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">let*</span> <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">(</span>family <span style="color: #A3BE8C;">"Iosevka SS10"</span><span style="color: #81A1C1;">)</span>
       <span style="color: #81A1C1;">(</span>size <span style="color: #5E81AC;">(</span><span style="color: #81A1C1;">if</span> <span style="color: #D08770;">(</span>eq system-type 'darwin<span style="color: #D08770;">)</span>
                 18 <span style="color: #616e88;">;; </span><span style="color: #616e88;">on MacOS HiDPI scaling works out of the box</span>
               26<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span> <span style="color: #616e88;">;; </span><span style="color: #616e88;">in Gnome HiDPI scaling doesn't work properly</span>
       <span style="color: #81A1C1;">(</span>spec <span style="color: #5E81AC;">(</span>font-spec <span style="color: #81A1C1;">:family</span> family <span style="color: #81A1C1;">:size</span> size <span style="color: #81A1C1;">:weight</span> 'semi-light<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>set-face-attribute 'default nil <span style="color: #81A1C1;">:font</span> spec<span style="color: #88C0D0;">)</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">fixed-pitch was set to "Monospace" font by default</span>
  <span style="color: #88C0D0;">(</span>set-face-attribute 'fixed-pitch nil <span style="color: #81A1C1;">:family</span> family<span style="color: #88C0D0;">)</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">variable-pitch was is set "non-monospace" font by default</span>
  <span style="color: #88C0D0;">(</span>set-face-attribute 'variable-pitch nil <span style="color: #81A1C1;">:family</span> family<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<a href="https://www.nordtheme.com/">Nord</a> is my favourite theme:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'nord-theme<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">nord-theme</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>load-theme 'nord t<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
But it has some missing parts and some parts are designed in a way I
do not like. Let's fix it! Unfortunately I haven't realized how to use
<code>custom-theme-set-faces</code> here so I merely update global face
settings. While I do not need secondary theme it's good enbough for
me.
</p>

<p>
<a href="https://www.nordtheme.com/docs/colors-and-palettes">Nord palletes</a> are used here for colors when applicable.
</p>

<p>
Related issues:
</p>
<ul class="org-ul">
<li><a href="https://github.com/nordtheme/emacs/issues/105">Missing tab bar colors</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">let</span> <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">(</span>nord0 <span style="color: #A3BE8C;">"#2E3440"</span><span style="color: #81A1C1;">)</span>
      <span style="color: #81A1C1;">(</span>nord1 <span style="color: #A3BE8C;">"#3B4252"</span><span style="color: #81A1C1;">)</span>
      <span style="color: #81A1C1;">(</span>nord3 <span style="color: #A3BE8C;">"#4C566A"</span><span style="color: #81A1C1;">)</span>
      <span style="color: #81A1C1;">(</span>nord9 <span style="color: #A3BE8C;">"#81A1C1"</span><span style="color: #81A1C1;">)</span>
      <span style="color: #81A1C1;">(</span>nord10 <span style="color: #A3BE8C;">"#5E81AC"</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>custom-set-faces
   `<span style="color: #81A1C1;">(</span>tab-bar <span style="color: #5E81AC;">(</span><span style="color: #D08770;">(</span>t <span style="color: #EBCB8B;">(</span><span style="color: #81A1C1;">:background</span> ,nord1<span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
   `<span style="color: #81A1C1;">(</span>tab-bar-tab <span style="color: #5E81AC;">(</span><span style="color: #D08770;">(</span>t <span style="color: #EBCB8B;">(</span><span style="color: #81A1C1;">:background</span> ,nord0
                                  <span style="color: #81A1C1;">:weight</span> bold
                                  <span style="color: #81A1C1;">:box</span> <span style="color: #A3BE8C;">(</span><span style="color: #81A1C1;">:line-width</span> -1 <span style="color: #81A1C1;">:style</span> released-button<span style="color: #A3BE8C;">)</span><span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
   `<span style="color: #81A1C1;">(</span>tab-bar-tab-inactive <span style="color: #5E81AC;">(</span><span style="color: #D08770;">(</span>t <span style="color: #EBCB8B;">(</span><span style="color: #81A1C1;">:foreground</span> <span style="color: #A3BE8C;">"gray39"</span>
                                           <span style="color: #81A1C1;">:background</span> ,nord1<span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>

   `<span style="color: #81A1C1;">(</span>org-block <span style="color: #5E81AC;">(</span><span style="color: #D08770;">(</span>t <span style="color: #EBCB8B;">(</span><span style="color: #81A1C1;">:inherit</span> org-block <span style="color: #81A1C1;">:background</span> ,nord1<span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
   `<span style="color: #81A1C1;">(</span>org-headline-done <span style="color: #5E81AC;">(</span><span style="color: #D08770;">(</span>t <span style="color: #EBCB8B;">(</span><span style="color: #81A1C1;">:inherit</span> org-headline-done <span style="color: #81A1C1;">:foreground</span> ,nord10<span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
   <span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Unfortunately, it's pretty common that some interfaces from 3rd-party
libraries are not styled properly or look ugly. To fix it I need to
know which exact faces look ugly. <code>describe-face</code> is a great tool to
find out what face is used for a particular element, but invoking it
each time is annoying. So I wrote a minor mode that shows face under
current cursor position in the minibuffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-what-the-face</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Show face under point in the minibuffer."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">let</span> <span style="color: #81A1C1;">(</span><span style="color: #5E81AC;">(</span>face <span style="color: #D08770;">(</span>get-char-property <span style="color: #EBCB8B;">(</span>point<span style="color: #EBCB8B;">)</span> 'face<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">if</span> face
        <span style="color: #5E81AC;">(</span>message <span style="color: #A3BE8C;">"Face: %s"</span> face<span style="color: #5E81AC;">)</span>
      <span style="color: #5E81AC;">(</span>message <span style="color: #A3BE8C;">"No face at point"</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defvar</span> <span style="color: #D8DEE9;">my-what-the-face-last-point</span> nil
  <span style="color: #616e88;">"Last point where face was described."</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-what-the-face-adviced</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Show face under point in the minibuffer. (Only once after point change)"</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">unless</span> <span style="color: #81A1C1;">(</span>equal my-what-the-face-last-point <span style="color: #5E81AC;">(</span>point<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">setq</span> my-what-the-face-last-point <span style="color: #5E81AC;">(</span>point<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span>my-what-the-face<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">define-minor-mode</span> <span style="color: #88C0D0;">my-what-the-face-mode</span>
  <span style="color: #616e88;">"Minor mode to show face under point when cursor is moved."</span>
  <span style="color: #81A1C1;">:global</span> t
  <span style="color: #81A1C1;">:lighter</span> <span style="color: #A3BE8C;">" WTFace"</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">if</span> my-what-the-face-mode
      <span style="color: #81A1C1;">(</span>add-hook 'post-command-hook #'my-what-the-face-adviced 0 t<span style="color: #81A1C1;">)</span>
        <span style="color: #81A1C1;">(</span>remove-hook 'post-command-hook #'my-what-the-face-adviced t<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<i>Visible bell</i> is super-distracting and scary (especilly in the
night).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> visible-bell nil<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
