README.org
** Improve keybinding management with focus on /VIM/ editing style
There is a joke that "EMACS is a great operating system, but lacks a
good text editor". I know a fix for that: [[https://github.com/emacs-evil/evil][evil]]. It is a VIM emulation
layer for EMACS. Many folks including me think that it's the best
implementation of VIM that is not VIM.

First step is to install ~evil~ dependencies.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'undo-tree)
(require 'undo-tree)

(global-undo-tree-mode)

(straight-use-package 'goto-chg)
(require 'goto-chg)
#+END_SRC

[[https://elpa.gnu.org/packages/undo-tree.html][undo-tree]] is a great package that provides a more advanced undo and
redo system. It's a must-have for ~evil~. But it has an annoying
behaviour: on each undo history save it shows a message in minibuffer.
Sometimes it shadows important messages. I found solution [[https://emacs.stackexchange.com/questions/59942/is-it-possible-suppress-save-message-for-undo-tree][here]].

#+BEGIN_SRC emacs-lisp
(defun my-undo-tree-save-history (undo-tree-save-history &rest args)
  (let ((message-log-max nil)
        (inhibit-message t))
    (apply undo-tree-save-history args)))

(advice-add 'undo-tree-save-history :around 'my-undo-tree-save-history)
#+END_SRC

Now everything is ready for ~evil~.

#+BEGIN_SRC emacs-lisp
;; it's required by evil-collection
(setq evil-want-keybinding nil)

(straight-use-package 'evil)

;; smaller undo steps
(setq evil-want-fine-undo t)

(setq evil-undo-system 'undo-tree)

(require 'evil)
(evil-mode 1)
#+END_SRC

Many EMACS packages do not provide VIM keybindings out of the box. But
[[https://github.com/emacs-evil/evil-collection][evil-collection]] does it for many of them. I prefer not to enable all
of the collections, but only those that I really use. (And closer to
the corresponding configuration sections)

#+BEGIN_SRC emacs-lisp
(straight-use-package 'evil-collection)
(require 'evil-collection)

(evil-collection-image-setup)
(evil-collection-xref-setup)
(evil-collection-bookmark-setup)
(evil-collection-compile-setup)
#+END_SRC

EMAСS has a lot of keybindings. And I'm adding even more! So it's a
good idea to improve keybinding discoverability. And [[https://github.com/justbur/emacs-which-key][which-key]] is the
best tool for that!

#+BEGIN_SRC emacs-lisp
(setq which-key-idle-delay 0.4
      which-key-max-description-length 120)

(straight-use-package 'which-key)
(require 'which-key)

(which-key-mode)
#+END_SRC

Vanilla EMACS keybindings definition system is not very convenient and
sometimes hard to understand. ~evil~ adds concept of modes on top of
it and makes it even more complicated. So here I feel need for a
unified and easy to use keybinding definition solution. [[https://github.com/noctuid/general.el][General]] does
it perfectly by hiding complex parts behind a simple API.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'general)
(require 'general)
#+END_SRC

My first EMACS "distribution" was [[https://spacemacs.org/][Spacemacs]] and I really liked its
keybinding system. ~general~ allows to create similar keybinding
definitions. And even more - define helpers tailored to my needs!

#+BEGIN_SRC emacs-lisp
(general-create-definer my-leader-def :states
  '(normal insert emacs)
  :prefix "SPC" :non-normal-prefix "C-s-SPC")
#+END_SRC

** Adjust keybindings to /MacOS/
Even [[https://bitbucket.org/mituharu/emacs-mac/src/master/][Mitsuharu Yamamoto's EMACS]] build for MacOS is not tailored for
keybindings that are common in MacOS GUI apps. Fortunately, it's easy
to fix.

#+BEGIN_SRC emacs-lisp
(when (eq system-type 'darwin)
  (setq locate-command "mdfind")
  (setq mac-command-modifier 'super
        mac-option-modifier 'meta)

  (general-define-key
   "s-c" 'kill-ring-save
   "s-v" 'yank
   "s-x" 'kill-region

   "s-s" 'save-buffer
   "s-o" 'find-file

   "s-a" 'mark-whole-buffer
   "s-z" 'undo
   "s-f" 'consult-line

   "s-<left>" 'beginning-of-line
   "s-<right>" 'end-of-line
   "s-<up>" 'beginning-of-buffer
   "s-<down>" 'end-of-buffer
   "M-<up>" 'backward-paragraph
   "M-<down>" 'forward-paragraph

   "s-/" 'comment-line
   ))
#+END_SRC

** Analyze /my behaviour/
In order to make data-driven decisions about configuration, I need
tools to analyze my behaviour. keyfreq is a great package that
provides a simple way to track keybindings usage.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'keyfreq)
(setq keyfreq-excluded-commands
      '(mac-mwheel-scroll ;; mouse movement
        evil-forward-char ;; basic VIM movement
        evil-backward-char
        evil-forward-word-end
        evil-backward-word-begin
        evil-next-line
        evil-previous-line))
(require 'keyfreq)
(keyfreq-mode 1)
(keyfreq-autosave-mode 1)
#+END_SRC

** Improve integration with /clipboard/
Let's enable saving existing clipboard text into kill ring before
replacing it.

#+BEGIN_SRC emacs-lisp
(setq save-interprogram-paste-before-kill t)
#+END_SRC

