README.html
<div id="outline-container-org0bda69b" class="outline-3">
<h3 id="org0bda69b"><span class="section-number-3">1.9.</span> Improve keybinding management with focus on <i>VIM</i> editing style</h3>
<div class="outline-text-3" id="text-1-9">
<p>
There is a joke that "EMACS is a great operating system, but lacks a
good text editor". I know a fix for that: <a href="https://github.com/emacs-evil/evil">evil</a>. It is a VIM emulation
layer for EMACS. Many folks including me think that it's the best
implementation of VIM that is not VIM.
</p>

<p>
First step is to install <code>evil</code> dependencies.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'undo-tree<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">undo-tree</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>global-undo-tree-mode<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>straight-use-package 'goto-chg<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">goto-chg</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<a href="https://elpa.gnu.org/packages/undo-tree.html">undo-tree</a> is a great package that provides a more advanced undo and
redo system. It's a must-have for <code>evil</code>. But it has an annoying
behaviour: on each undo history save it shows a message in minibuffer.
Sometimes it shadows important messages. I found solution <a href="https://emacs.stackexchange.com/questions/59942/is-it-possible-suppress-save-message-for-undo-tree">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-undo-tree-save-history</span> <span style="color: #88C0D0;">(</span>undo-tree-save-history <span style="color: #8FBCBB;">&amp;rest</span> args<span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">let</span> <span style="color: #81A1C1;">(</span><span style="color: #5E81AC;">(</span>message-log-max nil<span style="color: #5E81AC;">)</span>
        <span style="color: #5E81AC;">(</span>inhibit-message t<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span>apply undo-tree-save-history args<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>advice-add 'undo-tree-save-history <span style="color: #81A1C1;">:around</span> 'my-undo-tree-save-history<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Now everything is ready for <code>evil</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">it's required by evil-collection</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> evil-want-keybinding nil<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>straight-use-package 'evil<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">evil</span><span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">smaller undo steps</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> evil-want-fine-undo t<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> evil-undo-system 'undo-tree<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>evil-mode 1<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Many EMACS packages do not provide VIM keybindings out of the box. But
<a href="https://github.com/emacs-evil/evil-collection">evil-collection</a> does it for many of them. I prefer not to enable all
of the collections, but only those that I really use. (And closer to
the corresponding configuration sections)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'evil-collection<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">evil-collection</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>evil-collection-image-setup<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>evil-collection-xref-setup<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>evil-collection-bookmark-setup<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>evil-collection-compile-setup<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
EMAСS has a lot of keybindings. And I'm adding even more! So it's a
good idea to improve keybinding discoverability. And <a href="https://github.com/justbur/emacs-which-key">which-key</a> is the
best tool for that!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> which-key-idle-delay 0.4
      which-key-max-description-length 120<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>straight-use-package 'which-key<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">which-key</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>which-key-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Vanilla EMACS keybindings definition system is not very convenient and
sometimes hard to understand. <code>evil</code> adds concept of modes on top of
it and makes it even more complicated. So here I feel need for a
unified and easy to use keybinding definition solution. <a href="https://github.com/noctuid/general.el">General</a> does
it perfectly by hiding complex parts behind a simple API.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'general<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">general</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
My first EMACS "distribution" was <a href="https://spacemacs.org/">Spacemacs</a> and I really liked its
keybinding system. <code>general</code> allows to create similar keybinding
definitions. And even more - define helpers tailored to my needs!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-create-definer</span> my-leader-def <span style="color: #81A1C1;">:states</span>
  '<span style="color: #88C0D0;">(</span>normal insert emacs<span style="color: #88C0D0;">)</span>
  <span style="color: #81A1C1;">:prefix</span> <span style="color: #A3BE8C;">"SPC"</span> <span style="color: #81A1C1;">:non-normal-prefix</span> <span style="color: #A3BE8C;">"C-s-SPC"</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcdfe9ea" class="outline-3">
<h3 id="orgcdfe9ea"><span class="section-number-3">1.10.</span> Adjust keybindings to <i>MacOS</i></h3>
<div class="outline-text-3" id="text-1-10">
<p>
Even <a href="https://bitbucket.org/mituharu/emacs-mac/src/master/">Mitsuharu Yamamoto's EMACS</a> build for MacOS is not tailored for
keybindings that are common in MacOS GUI apps. Fortunately, it's easy
to fix.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">when</span> <span style="color: #88C0D0;">(</span>eq system-type 'darwin<span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">setq</span> locate-command <span style="color: #A3BE8C;">"mdfind"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">setq</span> mac-command-modifier 'super
        mac-option-modifier 'meta<span style="color: #88C0D0;">)</span>

  <span style="color: #88C0D0;">(</span>general-define-key
   <span style="color: #A3BE8C;">"s-c"</span> 'kill-ring-save
   <span style="color: #A3BE8C;">"s-v"</span> 'yank
   <span style="color: #A3BE8C;">"s-x"</span> 'kill-region

   <span style="color: #A3BE8C;">"s-s"</span> 'save-buffer
   <span style="color: #A3BE8C;">"s-o"</span> 'find-file

   <span style="color: #A3BE8C;">"s-a"</span> 'mark-whole-buffer
   <span style="color: #A3BE8C;">"s-z"</span> 'undo
   <span style="color: #A3BE8C;">"s-f"</span> 'consult-line

   <span style="color: #A3BE8C;">"s-&lt;left&gt;"</span> 'beginning-of-line
   <span style="color: #A3BE8C;">"s-&lt;right&gt;"</span> 'end-of-line
   <span style="color: #A3BE8C;">"s-&lt;up&gt;"</span> 'beginning-of-buffer
   <span style="color: #A3BE8C;">"s-&lt;down&gt;"</span> 'end-of-buffer
   <span style="color: #A3BE8C;">"M-&lt;up&gt;"</span> 'backward-paragraph
   <span style="color: #A3BE8C;">"M-&lt;down&gt;"</span> 'forward-paragraph

   <span style="color: #A3BE8C;">"s-/"</span> 'comment-line
   <span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org031f892" class="outline-3">
<h3 id="org031f892"><span class="section-number-3">1.11.</span> Improve integration with <i>clipboard</i></h3>
<div class="outline-text-3" id="text-1-11">
<p>
Let's enable saving existing clipboard text into kill ring before
replacing it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> save-interprogram-paste-before-kill t<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
