README.org
** Load shell /environment/ variables
EMAСS GUI for MacOS does not load shell environment variables. It's a
common issue for MacOS users. [[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]] solves the
problem.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'exec-path-from-shell)
(require 'exec-path-from-shell)

(add-to-list 'exec-path-from-shell-variables "LANG")
(add-to-list 'exec-path-from-shell-variables "LC_ALL")
(add-to-list 'exec-path-from-shell-variables "LC_CTYPE")

(exec-path-from-shell-initialize)
#+END_SRC

