README.html
<div id="outline-container-org17984a5" class="outline-3">
<h3 id="org17984a5"><span class="section-number-3">1.12.</span> Load shell <i>environment</i> variables</h3>
<div class="outline-text-3" id="text-1-12">
<p>
EMAСS GUI for MacOS does not load shell environment variables. It's a
common issue for MacOS users. <a href="https://github.com/purcell/exec-path-from-shell">exec-path-from-shell</a> solves the
problem.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'exec-path-from-shell<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">exec-path-from-shell</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-to-list 'exec-path-from-shell-variables <span style="color: #A3BE8C;">"LANG"</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-to-list 'exec-path-from-shell-variables <span style="color: #A3BE8C;">"LC_ALL"</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-to-list 'exec-path-from-shell-variables <span style="color: #A3BE8C;">"LC_CTYPE"</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>exec-path-from-shell-initialize<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
