README.org
** Improve /minibuffer completion/ experience
EMACS's default [[https://www.emacswiki.org/emacs/MinibufferCompletion][minibuffer completion]] solutions do their job, but
there are better ones. Personally, I prefer solution based on packages
like ~vertico~: in contrast to some completion frameworks like ~helm~,
~vertico~ (and others) enchance default completion system instead of
replacing it. Resulting in better integration with other EMACS
features.

Let's start with [[https://github.com/minad/vertico][vertico]]. It's a minimalistic vertical completion UI
similar to ~ivy~ or ~helm~. By reusing the built-in facilities system,
Vertico achieves full compatibility with built-in Emacs completion
commands and completion tables.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'vertico)
(setq vertico-cycle t)
(vertico-mode)
#+END_SRC

Often I want to focus on commands with particular prefix. For example ~my-~ or ~copilot-~.

#+BEGIN_SRC emacs-lisp
(defun my-vertico-replace-with-common-prefix ()
  "Replaces current vertico input with common prefix query.

Replaces vertico input with '^str' where str is the common prefix
for candidates that starts with the first component of current
vertico input."
  (interactive)
  (when-let* ((current-input (or (car vertico--input) (minibuffer-contents-no-properties)))
              (prefix-from-input (->> current-input
                                      (s-split " ")
                                      (-first-item)
                                      (s-replace "^" "")))
              (common-prefix (-some->> vertico--candidates
                               (--select (s-prefix? prefix-from-input it))
                               (--reduce (fill-common-string-prefix it acc))))
              (next-search-query (s-concat "^" common-prefix)))
    (delete-minibuffer-contents)
    (insert next-search-query)))

(general-def :keymaps 'vertico-map
  (kbd "C-<tab>") #'my-vertico-replace-with-common-prefix)
#+END_SRC

[[https://github.com/oantolin/orderless]["Emacs completion style that matches multiple regexps in any
order"]]. Sounds good!

#+BEGIN_SRC emacs-lisp
(straight-use-package 'orderless)
(require 'orderless)
#+END_SRC

I want to use orderless exclusively. But for better compatibility with
other packages I need to set completion-styles in the following way
(see ~orderless~ [[https://github.com/oantolin/orderless][README]]).

#+BEGIN_SRC emacs-lisp
(setq completion-styles '(orderless basic))
(setq completion-category-defaults nil)
(setq completion-category-overrides '((file (styles basic partial-completion))))
#+END_SRC

[[https://github.com/minad/consult][consult]] is a great package that provides a lot of useful commands
based on ~completing-read~. 

#+BEGIN_SRC emacs-lisp
(straight-use-package 'consult)
(require 'consult)
#+END_SRC

I found that some packages use ~multi-occur~ function. So I need
override it with ~consult-multi-occur~ to have better UI for related
commands.

#+BEGIN_SRC emacs-lisp
(advice-add #'multi-occur :override #'consult-multi-occur)
#+END_SRC

~consult~ commands like ~consult-buffer~ shows "previews" of buffers
(by temporary switching to them). It can potentially lead to some
performance issues. To mitigate them I created this helpers. But it's
better to use ~consult-preview-allowed-hooks~ for that if possible.
At the moment of writing I do not use this helpers, but prefer to keep
them here for a while.

#+BEGIN_SRC emacs-lisp
(defun consult-preview-p ()
  "Return true when minibuffer in a 'consult preview' state'"
  (when-let
      (win (active-minibuffer-window))
    (not (eq nil (buffer-local-value 'consult--preview-function (window-buffer win))))))

(defun my-inhibit-if-consult-preview (oldfun &rest args)
  "An around advice to disable some functions in the case of consult preview"
  (unless (consult-preview-p)
    (apply oldfun args)))
#+END_SRC

While ~consult~ improves flow of common EMACS commands, [[https://github.com/minad/marginalia][marginilia]]
improves how items displayed in ~completing-read~ by adding some extra
information.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'marginalia)
(require 'marginalia)
(marginalia-mode)
#+END_SRC

