README.html
<div id="outline-container-orgd85c959" class="outline-3">
<h3 id="orgd85c959"><span class="section-number-3">1.13.</span> Improve <i>minibuffer completion</i> experience</h3>
<div class="outline-text-3" id="text-1-13">
<p>
EMACS's default <a href="https://www.emacswiki.org/emacs/MinibufferCompletion">minibuffer completion</a> solutions do their job, but
there are better ones. Personally, I prefer solution based on packages
like <code>vertico</code>: in contrast to some completion frameworks like <code>helm</code>,
<code>vertico</code> (and others) enchance default completion system instead of
replacing it. Resulting in better integration with other EMACS
features.
</p>

<p>
Let's start with <a href="https://github.com/minad/vertico">vertico</a>. It's a minimalistic vertical completion UI
similar to <code>ivy</code> or <code>helm</code>. By reusing the built-in facilities system,
Vertico achieves full compatibility with built-in Emacs completion
commands and completion tables.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'vertico<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> vertico-cycle t<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>vertico-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Often I want to focus on commands with particular prefix. For example <code>my-</code> or <code>copilot-</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-vertico-replace-with-common-prefix</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Replaces current vertico input with common prefix query.</span>

<span style="color: #616e88;">Replaces vertico input with '</span><span style="color: #81A1C1;">^str</span><span style="color: #616e88;">' where str is the common prefix</span>
<span style="color: #616e88;">for candidates that starts with the first component of current</span>
<span style="color: #616e88;">vertico input."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">when-let*</span> <span style="color: #81A1C1;">(</span><span style="color: #5E81AC;">(</span>current-input <span style="color: #D08770;">(</span><span style="color: #81A1C1;">or</span> <span style="color: #EBCB8B;">(</span>car vertico--input<span style="color: #EBCB8B;">)</span> <span style="color: #EBCB8B;">(</span>minibuffer-contents-no-properties<span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
              <span style="color: #5E81AC;">(</span>prefix-from-input <span style="color: #D08770;">(</span><span style="color: #81A1C1;">-&gt;&gt;</span> current-input
                                      <span style="color: #EBCB8B;">(</span>s-split <span style="color: #A3BE8C;">" "</span><span style="color: #EBCB8B;">)</span>
                                      <span style="color: #EBCB8B;">(</span>-first-item<span style="color: #EBCB8B;">)</span>
                                      <span style="color: #EBCB8B;">(</span>s-replace <span style="color: #A3BE8C;">"^"</span> <span style="color: #A3BE8C;">""</span><span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
              <span style="color: #5E81AC;">(</span>common-prefix <span style="color: #D08770;">(</span><span style="color: #81A1C1;">-some-&gt;&gt;</span> vertico--candidates
                               <span style="color: #EBCB8B;">(</span><span style="color: #81A1C1;">--select</span> <span style="color: #A3BE8C;">(</span>s-prefix? prefix-from-input it<span style="color: #A3BE8C;">)</span><span style="color: #EBCB8B;">)</span>
                               <span style="color: #EBCB8B;">(</span><span style="color: #81A1C1;">--reduce</span> <span style="color: #A3BE8C;">(</span>fill-common-string-prefix it acc<span style="color: #A3BE8C;">)</span><span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
              <span style="color: #5E81AC;">(</span>next-search-query <span style="color: #D08770;">(</span>s-concat <span style="color: #A3BE8C;">"^"</span> common-prefix<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span>delete-minibuffer-contents<span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span>insert next-search-query<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-def</span> <span style="color: #81A1C1;">:keymaps</span> 'vertico-map
  <span style="color: #88C0D0;">(</span>kbd <span style="color: #A3BE8C;">"C-&lt;tab&gt;"</span><span style="color: #88C0D0;">)</span> #'my-vertico-replace-with-common-prefix<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<a href="https://github.com/oantolin/orderless">"Emacs completion style that matches multiple regexps in any
order"</a>. Sounds good!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'orderless<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">orderless</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
I want to use orderless exclusively. But for better compatibility with
other packages I need to set completion-styles in the following way
(see <code>orderless</code> <a href="https://github.com/oantolin/orderless">README</a>).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> completion-styles '<span style="color: #88C0D0;">(</span>orderless basic<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> completion-category-defaults nil<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> completion-category-overrides '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">(</span>file <span style="color: #5E81AC;">(</span>styles basic partial-completion<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<a href="https://github.com/minad/consult">consult</a> is a great package that provides a lot of useful commands
based on <code>completing-read</code>. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'consult<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">consult</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
I found that some packages use <code>multi-occur</code> function. So I need
override it with <code>consult-multi-occur</code> to have better UI for related
commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>advice-add #'multi-occur <span style="color: #81A1C1;">:override</span> #'consult-multi-occur<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<code>consult</code> commands like <code>consult-buffer</code> shows "previews" of buffers
(by temporary switching to them). It can potentially lead to some
performance issues. To mitigate them I created this helpers. But it's
better to use <code>consult-preview-allowed-hooks</code> for that if possible.
At the moment of writing I do not use this helpers, but prefer to keep
them here for a while.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">consult-preview-p</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Return true when minibuffer in a 'consult preview' state'"</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">when-let</span>
      <span style="color: #81A1C1;">(</span>win <span style="color: #5E81AC;">(</span>active-minibuffer-window<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span>not <span style="color: #5E81AC;">(</span>eq nil <span style="color: #D08770;">(</span>buffer-local-value 'consult--preview-function <span style="color: #EBCB8B;">(</span>window-buffer win<span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-inhibit-if-consult-preview</span> <span style="color: #88C0D0;">(</span>oldfun <span style="color: #8FBCBB;">&amp;rest</span> args<span style="color: #88C0D0;">)</span>
  <span style="color: #616e88;">"An around advice to disable some functions in the case of consult preview"</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">unless</span> <span style="color: #81A1C1;">(</span>consult-preview-p<span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span>apply oldfun args<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
While <code>consult</code> improves flow of common EMACS commands, <a href="https://github.com/minad/marginalia">marginilia</a>
improves how items displayed in <code>completing-read</code> by adding some extra
information.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'marginalia<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">marginalia</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>marginalia-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
