README.org
** Improve /ediff/ experience
~ediff~ is a great tool for comparing files and directories. But it
has some weird defaults.

#+BEGIN_SRC emacs-lisp
(setq
 ;; no extra frames!
 ediff-window-setup-function 'ediff-setup-windows-plain 
 ;; horizontal split instead of vertical
 ediff-split-window-function 'split-window-horizontally)

(require 'ediff)
#+END_SRC

** Improve /dired/ experience
File explorer is a must-have feature for any editor. EMACS has
~dired~. But it needs to be adjusted to our setup.

Under the hood ~dired~ uses ~ls~ command to list files. But MacOS has
a different version of ~ls~ that does not support some options that
are used by default. So I need to use ~gls~ instead of ~ls~ on MacOS.

#+BEGIN_SRC emacs-lisp
(setq insert-directory-program (if (eq system-type 'darwin) "gls" "ls"))
#+END_SRC

I want to see hidden files by default. And I want to see directories
first.

#+BEGIN_SRC emacs-lisp
(setq dired-listing-switches "-lah -v --group-directories-first")
#+END_SRC

When using ~dired~ on remote directories (via ~tramp~) we usually want
to use ~ls~ instead of ~gls~.

#+BEGIN_SRC emacs-lisp
(defun my-remote-dired-hook ()
  "Adjusts Dired behaviour in the case of remote dirs"
  (when (file-remote-p default-directory)
    (setq-local dired-actual-switches "-lah")
    (setq-local insert-directory-program "ls")))

(add-hook 'dired-mode-hook #'my-remote-dired-hook)
(add-hook 'dired-mode-hook #'diff-hl-dired-mode)
#+END_SRC

And I want adjust it to Vim-style keybindings.

#+BEGIN_SRC emacs-lisp
(evil-collection-dired-setup)

;; fix of evil-collection
(general-unbind
  :states '(normal visual)
  :keymaps 'dired-mode-map
  "SPC")
#+END_SRC

Also I want to see [[https://github.com/jtbm37/all-the-icons-dired][icons]] in ~dired~. Colorful ones!

#+BEGIN_SRC emacs-lisp
(straight-use-package 'all-the-icons-dired)
(setq all-the-icons-dired-monochrome nil)
(require 'all-the-icons-dired)
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
#+END_SRC

** Improve /ibuffer/ experience
IBuffer is an integrated buffer manager for EMACS. Sometimes I use it
so I need to "vimify" it and make a bit more prettier.

#+BEGIN_SRC emacs-lisp
(evil-collection-ibuffer-setup)

(straight-use-package 'all-the-icons-ibuffer)
(require 'all-the-icons-ibuffer)
(add-hook 'ibuffer-mode-hook #'all-the-icons-ibuffer-mode)
#+END_SRC

** Improve /internal help/ system
[[https://github.com/Wilfred/helpful][helpful]] is a great package that improves EMACS built-in help system.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'helpful)
(require 'helpful)

(evil-collection-helpful-setup)

(general-def
  "C-h f" #'helpful-callable
  "C-h v" #'helpful-variable
  "C-h k" #'helpful-key
  "C-h x" #'helpful-command
  "C-h F" #'helpful-function)
#+END_SRC

I prefer to use ~helpful-at-point~ instead of ~evil-lookup~ when
pressing ~K~ in normal or visual modes.

#+BEGIN_SRC emacs-lisp
;; evil uses `K` for `evil-lookup` so I need to unbind it first
(general-unbind evil-motion-state-map "K")

(general-def
  :states '(normal visual)
  :keymaps 'emacs-lisp-mode-map
  "K" #'helpful-at-point)
#+END_SRC

** Fix confusing /buffer naming/ when working with files with the same name
EMACS's traditional method for making buffer names unique adds <2>,
<3>, etc. to the end of (all but one) buffers. ~uniquify~ introduces
more informative naming conventions.

#+BEGIN_SRC emacs-lisp
(setq uniquify-buffer-name-style 'post-forward-angle-brackets)
(require 'uniquify)
#+END_SRC

