README.html
<div id="outline-container-orgc068804" class="outline-3">
<h3 id="orgc068804"><span class="section-number-3">1.14.</span> Improve <i>ediff</i> experience</h3>
<div class="outline-text-3" id="text-1-14">
<p>
<code>ediff</code> is a great tool for comparing files and directories. But it
has some weird defaults.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span>
 <span style="color: #616e88;">;; </span><span style="color: #616e88;">no extra frames!</span>
 ediff-window-setup-function 'ediff-setup-windows-plain 
 <span style="color: #616e88;">;; </span><span style="color: #616e88;">horizontal split instead of vertical</span>
 ediff-split-window-function 'split-window-horizontally<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">ediff</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf7e9772" class="outline-3">
<h3 id="orgf7e9772"><span class="section-number-3">1.15.</span> Improve <i>dired</i> experience</h3>
<div class="outline-text-3" id="text-1-15">
<p>
File explorer is a must-have feature for any editor. EMACS has
<code>dired</code>. But it needs to be adjusted to our setup.
</p>

<p>
Under the hood <code>dired</code> uses <code>ls</code> command to list files. But MacOS has
a different version of <code>ls</code> that does not support some options that
are used by default. So I need to use <code>gls</code> instead of <code>ls</code> on MacOS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> insert-directory-program <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">(</span>eq system-type 'darwin<span style="color: #81A1C1;">)</span> <span style="color: #A3BE8C;">"gls"</span> <span style="color: #A3BE8C;">"ls"</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
I want to see hidden files by default. And I want to see directories
first.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> dired-listing-switches <span style="color: #A3BE8C;">"-lah -v --group-directories-first"</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
When using <code>dired</code> on remote directories (via <code>tramp</code>) we usually want
to use <code>ls</code> instead of <code>gls</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-remote-dired-hook</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Adjusts Dired behaviour in the case of remote dirs"</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">when</span> <span style="color: #81A1C1;">(</span>file-remote-p default-directory<span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">setq-local</span> dired-actual-switches <span style="color: #A3BE8C;">"-lah"</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">setq-local</span> insert-directory-program <span style="color: #A3BE8C;">"ls"</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'dired-mode-hook #'my-remote-dired-hook<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'dired-mode-hook #'diff-hl-dired-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
And I want adjust it to Vim-style keybindings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>evil-collection-dired-setup<span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">fix of evil-collection</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-unbind</span>
  <span style="color: #81A1C1;">:states</span> '<span style="color: #88C0D0;">(</span>normal visual<span style="color: #88C0D0;">)</span>
  <span style="color: #81A1C1;">:keymaps</span> 'dired-mode-map
  <span style="color: #A3BE8C;">"SPC"</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Also I want to see <a href="https://github.com/jtbm37/all-the-icons-dired">icons</a> in <code>dired</code>. Colorful ones!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'all-the-icons-dired<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> all-the-icons-dired-monochrome nil<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">all-the-icons-dired</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'dired-mode-hook 'all-the-icons-dired-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1ddbd1c" class="outline-3">
<h3 id="org1ddbd1c"><span class="section-number-3">1.16.</span> Improve <i>ibuffer</i> experience</h3>
<div class="outline-text-3" id="text-1-16">
<p>
IBuffer is an integrated buffer manager for EMACS. Sometimes I use it
so I need to "vimify" it and make a bit more prettier.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>evil-collection-ibuffer-setup<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>straight-use-package 'all-the-icons-ibuffer<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">all-the-icons-ibuffer</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'ibuffer-mode-hook #'all-the-icons-ibuffer-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgae2105e" class="outline-3">
<h3 id="orgae2105e"><span class="section-number-3">1.17.</span> Improve <i>internal help</i> system</h3>
<div class="outline-text-3" id="text-1-17">
<p>
<a href="https://github.com/Wilfred/helpful">helpful</a> is a great package that improves EMACS built-in help system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'helpful<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">helpful</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>evil-collection-helpful-setup<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-def</span>
  <span style="color: #A3BE8C;">"C-h f"</span> #'helpful-callable
  <span style="color: #A3BE8C;">"C-h v"</span> #'helpful-variable
  <span style="color: #A3BE8C;">"C-h k"</span> #'helpful-key
  <span style="color: #A3BE8C;">"C-h x"</span> #'helpful-command
  <span style="color: #A3BE8C;">"C-h F"</span> #'helpful-function<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
I prefer to use <code>helpful-at-point</code> instead of <code>evil-lookup</code> when
pressing <code>K</code> in normal or visual modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">evil uses `K` for `evil-lookup` so I need to unbind it first</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-unbind</span> evil-motion-state-map <span style="color: #A3BE8C;">"K"</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-def</span>
  <span style="color: #81A1C1;">:states</span> '<span style="color: #88C0D0;">(</span>normal visual<span style="color: #88C0D0;">)</span>
  <span style="color: #81A1C1;">:keymaps</span> 'emacs-lisp-mode-map
  <span style="color: #A3BE8C;">"K"</span> #'helpful-at-point<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org403656f" class="outline-3">
<h3 id="org403656f"><span class="section-number-3">1.18.</span> Fix confusing <i>buffer naming</i> when working with files with the same name</h3>
<div class="outline-text-3" id="text-1-18">
<p>
EMACS's traditional method for making buffer names unique adds &lt;2&gt;,
&lt;3&gt;, etc. to the end of (all but one) buffers. <code>uniquify</code> introduces
more informative naming conventions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> uniquify-buffer-name-style 'post-forward-angle-brackets<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">uniquify</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
