README.org
** Improve /buffer killing/ flow
I found that ~kill-this-buffer~ is not very convenient for me. So I
implemented my own commands that fits my needs better.

#+BEGIN_SRC emacs-lisp
(defun my-kill-this-buffer ()
  "Kill current buffer if it isn't used in other windows or tabs. Otherwise switch to previous buffer, with a message."
  (interactive)
  (let ((buffer (current-buffer)))
    (if (or
         (delq (selected-window) (get-buffer-window-list buffer nil t))
         (tab-bar-get-buffer-tab (current-buffer) nil t))
        (progn
          (switch-to-prev-buffer)
          (message "Buffer is used in other window or tab. Switched to previous buffer."))
      (kill-buffer buffer))))

(defun my-force-kill-this-buffer ()
  "Kill current buffer unconditionally."
  (interactive)
  (kill-buffer (current-buffer)))

(defun my-kill-other-buffers ()
  "Kill all other buffers."
  (interactive)
  (mapc 'kill-buffer (delq (current-buffer) (buffer-list))))
#+END_SRC

** Fast jumps between /distant places/ in buffer
VIM keybindings and ~consult-line~ already allows to jump really fast
between lines. But to bring "to the moon" experience here I need to
add [[https://github.com/abo-abo/avy][avy]].

#+BEGIN_SRC emacs-lisp
(straight-use-package 'avy)
(require 'avy)

(general-def "C-;" #'avy-goto-char)
#+END_SRC

** Improve /window splitting/ behaviour
I didn't like default window splitting behaviour. So I decided to
write my own window splitting function that relies on current window
aspect ratio.

#+BEGIN_SRC emacs-lisp
(defvar my-split-window-aspect-ratio-threshold 2.0
  "If window aspect ratio lower than this
`my-split-window' will split verically.

Ratio calculated as width divided by height.")

(defun my-split-window (&optional window)
  "Alternative to `split-window-sensibly' that
relies on current window aspect ratio.

See `my-split-window-aspect-ratio-threshold'."
  (let* ((window (or window (selected-window)))
         (width (float (window-width window)))
         (height (float (window-height window)))
         (ratio (/ width height)))
    (with-selected-window window
      (if (< ratio my-split-window-aspect-ratio-threshold)
          (split-window-below)
        (split-window-right)))))

(setq split-window-preferred-function 'my-split-window)
#+END_SRC

** Fast jumping between /distant windows/
When you have a lot of windows open, it can be annoying to jump to a
distant one (e.g. window in another frame). [[https://github.com/abo-abo/ace-window][ace-window]] is a great
package that allows to do it quickly.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'ace-window)
(require 'ace-window)

(general-def :states '(normal visual)
  "C-w C-w" #'ace-window)
#+END_SRC

** Be able to keep multiple /window layouts/ open
Tabs in EMACS are not like tabs in other editors. They are more like a
way to keep multiple window layouts open. I found them very useful
when working on multiple projects or when I need to switch between
different layouts quickly.

#+BEGIN_SRC emacs-lisp
;; better visual appearance
(setq tab-bar-show 1)
(setq tab-bar-close-button-show nil)
(setq tab-bar-new-button-show nil)

;; MacOS-style keybindings
(general-def
  "s-{" #'tab-bar-switch-to-prev-tab
  "s-}" #'tab-bar-switch-to-next-tab
  "s-n" #'tab-bar-duplicate-tab
  "s-t" #'tab-bar-duplicate-tab
  "s-w" #'tab-bar-close-tab
  "s-r" #'tab-bar-rename-tab)
#+END_SRC

