README.html
<div id="outline-container-org9e54d84" class="outline-3">
<h3 id="org9e54d84"><span class="section-number-3">1.19.</span> Improve <i>buffer killing</i> flow</h3>
<div class="outline-text-3" id="text-1-19">
<p>
I found that <code>kill-this-buffer</code> is not very convenient for me. So I
implemented my own commands that fits my needs better.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-kill-this-buffer</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Kill current buffer if it isn't used in other windows or tabs. Otherwise switch to previous buffer, with a message."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">let</span> <span style="color: #81A1C1;">(</span><span style="color: #5E81AC;">(</span>buffer <span style="color: #D08770;">(</span>current-buffer<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">if</span> <span style="color: #5E81AC;">(</span><span style="color: #81A1C1;">or</span>
         <span style="color: #D08770;">(</span>delq <span style="color: #EBCB8B;">(</span>selected-window<span style="color: #EBCB8B;">)</span> <span style="color: #EBCB8B;">(</span>get-buffer-window-list buffer nil t<span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span>
         <span style="color: #D08770;">(</span>tab-bar-get-buffer-tab <span style="color: #EBCB8B;">(</span>current-buffer<span style="color: #EBCB8B;">)</span> nil t<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
        <span style="color: #5E81AC;">(</span><span style="color: #81A1C1;">progn</span>
          <span style="color: #D08770;">(</span>switch-to-prev-buffer<span style="color: #D08770;">)</span>
          <span style="color: #D08770;">(</span>message <span style="color: #A3BE8C;">"Buffer is used in other window or tab. Switched to previous buffer."</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
      <span style="color: #5E81AC;">(</span>kill-buffer buffer<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-force-kill-this-buffer</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Kill current buffer unconditionally."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>kill-buffer <span style="color: #81A1C1;">(</span>current-buffer<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-kill-other-buffers</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Kill all other buffers."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>mapc 'kill-buffer <span style="color: #81A1C1;">(</span>delq <span style="color: #5E81AC;">(</span>current-buffer<span style="color: #5E81AC;">)</span> <span style="color: #5E81AC;">(</span>buffer-list<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org65ee3fb" class="outline-3">
<h3 id="org65ee3fb"><span class="section-number-3">1.20.</span> Fast jumps between <i>distant places</i> in buffer</h3>
<div class="outline-text-3" id="text-1-20">
<p>
VIM keybindings and <code>consult-line</code> already allows to jump really fast
between lines. But to bring "to the moon" experience here I need to
add <a href="https://github.com/abo-abo/avy">avy</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'avy<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">avy</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-def</span> <span style="color: #A3BE8C;">"C-;"</span> #'avy-goto-char<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org449f94b" class="outline-3">
<h3 id="org449f94b"><span class="section-number-3">1.21.</span> Improve <i>window splitting</i> behaviour</h3>
<div class="outline-text-3" id="text-1-21">
<p>
I didn't like default window splitting behaviour. So I decided to
write my own window splitting function that relies on current window
aspect ratio.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defvar</span> <span style="color: #D8DEE9;">my-split-window-aspect-ratio-threshold</span> 2.0
  <span style="color: #616e88;">"If window aspect ratio lower than this</span>
<span style="color: #616e88;">`</span><span style="color: #81A1C1;">my-split-window</span><span style="color: #616e88;">' will split verically.</span>

<span style="color: #616e88;">Ratio calculated as width divided by height."</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-split-window</span> <span style="color: #88C0D0;">(</span><span style="color: #8FBCBB;">&amp;optional</span> window<span style="color: #88C0D0;">)</span>
  <span style="color: #616e88;">"Alternative to `</span><span style="color: #81A1C1;">split-window-sensibly</span><span style="color: #616e88;">' that</span>
<span style="color: #616e88;">relies on current window aspect ratio.</span>

<span style="color: #616e88;">See `</span><span style="color: #81A1C1;">my-split-window-aspect-ratio-threshold</span><span style="color: #616e88;">'."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">let*</span> <span style="color: #81A1C1;">(</span><span style="color: #5E81AC;">(</span>window <span style="color: #D08770;">(</span><span style="color: #81A1C1;">or</span> window <span style="color: #EBCB8B;">(</span>selected-window<span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
         <span style="color: #5E81AC;">(</span>width <span style="color: #D08770;">(</span>float <span style="color: #EBCB8B;">(</span>window-width window<span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
         <span style="color: #5E81AC;">(</span>height <span style="color: #D08770;">(</span>float <span style="color: #EBCB8B;">(</span>window-height window<span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
         <span style="color: #5E81AC;">(</span>ratio <span style="color: #D08770;">(</span>/ width height<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">with-selected-window</span> window
      <span style="color: #5E81AC;">(</span><span style="color: #81A1C1;">if</span> <span style="color: #D08770;">(</span>&lt; ratio my-split-window-aspect-ratio-threshold<span style="color: #D08770;">)</span>
          <span style="color: #D08770;">(</span>split-window-below<span style="color: #D08770;">)</span>
        <span style="color: #D08770;">(</span>split-window-right<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> split-window-preferred-function 'my-split-window<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org516aabe" class="outline-3">
<h3 id="org516aabe"><span class="section-number-3">1.22.</span> Fast jumping between <i>distant windows</i></h3>
<div class="outline-text-3" id="text-1-22">
<p>
When you have a lot of windows open, it can be annoying to jump to a
distant one (e.g. window in another frame). <a href="https://github.com/abo-abo/ace-window">ace-window</a> is a great
package that allows to do it quickly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'ace-window<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">ace-window</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-def</span> <span style="color: #81A1C1;">:states</span> '<span style="color: #88C0D0;">(</span>normal visual<span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"C-w C-w"</span> #'ace-window<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge229960" class="outline-3">
<h3 id="orge229960"><span class="section-number-3">1.23.</span> Be able to keep multiple <i>window layouts</i> open</h3>
<div class="outline-text-3" id="text-1-23">
<p>
Tabs in EMACS are not like tabs in other editors. They are more like a
way to keep multiple window layouts open. I found them very useful
when working on multiple projects or when I need to switch between
different layouts quickly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">better visual appearance</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> tab-bar-show 1<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> tab-bar-close-button-show nil<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> tab-bar-new-button-show nil<span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">MacOS-style keybindings</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-def</span>
  <span style="color: #A3BE8C;">"s-{"</span> #'tab-bar-switch-to-prev-tab
  <span style="color: #A3BE8C;">"s-}"</span> #'tab-bar-switch-to-next-tab
  <span style="color: #A3BE8C;">"s-n"</span> #'tab-bar-duplicate-tab
  <span style="color: #A3BE8C;">"s-t"</span> #'tab-bar-duplicate-tab
  <span style="color: #A3BE8C;">"s-w"</span> #'tab-bar-close-tab
  <span style="color: #A3BE8C;">"s-r"</span> #'tab-bar-rename-tab<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
