README.org
** Improve /text scaling/ flow
~text-scale-increase~ and ~text-scale-decrease~ are really convinient
commands, but I need more!

#+BEGIN_SRC emacs-lisp
(defun my-text-scale-0 ()
  "Text scale reset"
  (interactive)
  (text-scale-set 0))

(defun my-text-scale-big ()
  "Toggles big text scale"
  (interactive)
  (if (= text-scale-mode-amount 0)
      (text-scale-set 2)
    (my-text-scale-0)))
#+END_SRC

** Relative /line numbers/ by default, absolute on demand
When using VIM, relative line numbers are more convinient. But when
you demo something to someone or pairing via video call, it's better
to switch to absolute ones.

#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode 1)

(defun my-switch-line-numbers-mode ()
  "Changes line numbers mode between relative and absolute"
  (interactive)
  (if (eq display-line-numbers-type 'relative)
      (setq display-line-numbers-type t)
    (setq display-line-numbers-type 'relative))
  (display-line-numbers-mode t))
#+END_SRC

** /Do not show/ non-informative minor modes /in modeline/
In 99.9% cases I do not need information about these modes in my
modeline.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'diminish)
(require 'diminish)

(defun diminish-minor-modes ()
  "Diminishes non-informative modeline minore-modes' entries."
  (diminish 'which-key-mode)
  (diminish 'undo-tree-mode)
  (diminish 'gcmh-mode)
  (diminish 'subword-mode)
  (with-eval-after-load 'org-indent
    (diminish 'org-indent-mode))
  (diminish 'auto-revert-mode)
  (diminish 'org-auto-tangle-mode))

(add-hook 'emacs-startup-hook #'diminish-minor-modes)
#+END_SRC

** Use spaces for /identation/
I picked my side in the conflict.

#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
#+END_SRC

** Automatically add /newline/ at the end of the file
Like almost all modern editors do.

#+BEGIN_SRC emacs-lisp
(setq require-final-newline t)
#+END_SRC

** Handle situation when too many /file watches/ are added
Might be it's rude, but I decided to remove all watches when my EMACS
overwhemled by them.

#+BEGIN_SRC emacs-lisp
(defun my-rm-all-watches ()
  "Remove all existing file notification watches from EMACS."
  (interactive)
  (maphash
   (lambda (key _value)
     (file-notify-rm-watch key))
   file-notify-descriptors))
#+END_SRC

** Distiguish between different pairs of /delimiters/
When doing Lisp programming or some complex math expressions it's very
important to distinguish between different pairs of
delimiters. [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] solves the problem.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'rainbow-delimiters)
(require 'rainbow-delimiters)
#+END_SRC

** Deal with /pairs/ smarter
Oh... [[https://github.com/Fuco1/smartparens][smartparens]]... still struggling to use it properly. But I'm not
ready to give up!

#+BEGIN_SRC emacs-lisp
(straight-use-package 'smartparens)
(require 'smartparens-config)
#+END_SRC

** Make /regular expessions/ in this config more readable
Regular expessions are powerful, but hard to read. EMACS Lisp regular expressions are even harder to read because of double escaping. But we have ~rx~ macro that makes them much more readable. So when I adopt snippets from other sources I try to rewrite them using ~rx~. In order to do that simpler I use xr to generate ~rx~ expressions from string representations.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'xr)
(require 'xr)
#+END_SRC

** Open files in /existing instance/ of EMACS
Server mode allows to open files in existing EMACS instance from the
command line.

#+BEGIN_SRC emacs-lisp
(server-start)
#+END_SRC

