README.html
<div id="outline-container-org2b2330c" class="outline-3">
<h3 id="org2b2330c"><span class="section-number-3">1.24.</span> Improve <i>text scaling</i> flow</h3>
<div class="outline-text-3" id="text-1-24">
<p>
<code>text-scale-increase</code> and <code>text-scale-decrease</code> are really convinient
commands, but I need more!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-text-scale-0</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Text scale reset"</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>text-scale-set 0<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-text-scale-big</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Toggles big text scale"</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">(</span>= text-scale-mode-amount 0<span style="color: #81A1C1;">)</span>
      <span style="color: #81A1C1;">(</span>text-scale-set 2<span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span>my-text-scale-0<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga0a9440" class="outline-3">
<h3 id="orga0a9440"><span class="section-number-3">1.25.</span> Relative <i>line numbers</i> by default, absolute on demand</h3>
<div class="outline-text-3" id="text-1-25">
<p>
When using VIM, relative line numbers are more convinient. But when
you demo something to someone or pairing via video call, it's better
to switch to absolute ones.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> display-line-numbers-type 'relative<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>global-display-line-numbers-mode 1<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-switch-line-numbers-mode</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Changes line numbers mode between relative and absolute"</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">(</span>eq display-line-numbers-type 'relative<span style="color: #81A1C1;">)</span>
      <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">setq</span> display-line-numbers-type t<span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">setq</span> display-line-numbers-type 'relative<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>display-line-numbers-mode t<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org385c64e" class="outline-3">
<h3 id="org385c64e"><span class="section-number-3">1.26.</span> <i>Do not show</i> non-informative minor modes <i>in modeline</i></h3>
<div class="outline-text-3" id="text-1-26">
<p>
In 99.9% cases I do not need information about these modes in my
modeline.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'diminish<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">diminish</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">diminish-minor-modes</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Diminishes non-informative modeline minore-modes' entries."</span>
  <span style="color: #88C0D0;">(</span>diminish 'which-key-mode<span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>diminish 'undo-tree-mode<span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>diminish 'gcmh-mode<span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>diminish 'subword-mode<span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">with-eval-after-load</span> 'org-indent
    <span style="color: #81A1C1;">(</span>diminish 'org-indent-mode<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>diminish 'auto-revert-mode<span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>diminish 'org-auto-tangle-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'emacs-startup-hook #'diminish-minor-modes<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1a5f551" class="outline-3">
<h3 id="org1a5f551"><span class="section-number-3">1.27.</span> Use spaces for <i>identation</i></h3>
<div class="outline-text-3" id="text-1-27">
<p>
I picked my side in the conflict.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq-default</span> indent-tabs-mode nil<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org10ab012" class="outline-3">
<h3 id="org10ab012"><span class="section-number-3">1.28.</span> Automatically add <i>newline</i> at the end of the file</h3>
<div class="outline-text-3" id="text-1-28">
<p>
Like almost all modern editors do.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> require-final-newline t<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org27f832d" class="outline-3">
<h3 id="org27f832d"><span class="section-number-3">1.29.</span> Handle situation when too many <i>file watches</i> are added</h3>
<div class="outline-text-3" id="text-1-29">
<p>
Might be it's rude, but I decided to remove all watches when my EMACS
overwhemled by them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-rm-all-watches</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Remove all existing file notification watches from EMACS."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>maphash
   <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">lambda</span> <span style="color: #5E81AC;">(</span>key _value<span style="color: #5E81AC;">)</span>
     <span style="color: #5E81AC;">(</span>file-notify-rm-watch key<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
   file-notify-descriptors<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org727ea6e" class="outline-3">
<h3 id="org727ea6e"><span class="section-number-3">1.30.</span> Distiguish between different pairs of <i>delimiters</i></h3>
<div class="outline-text-3" id="text-1-30">
<p>
When doing Lisp programming or some complex math expressions it's very
important to distinguish between different pairs of
delimiters. <a href="https://github.com/Fanael/rainbow-delimiters">rainbow-delimiters</a> solves the problem.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'rainbow-delimiters<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">rainbow-delimiters</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org614277c" class="outline-3">
<h3 id="org614277c"><span class="section-number-3">1.31.</span> Deal with <i>pairs</i> smarter</h3>
<div class="outline-text-3" id="text-1-31">
<p>
Oh&#x2026; <a href="https://github.com/Fuco1/smartparens">smartparens</a>&#x2026; still struggling to use it properly. But I'm not
ready to give up!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'smartparens<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">smartparens-config</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9adfdc2" class="outline-3">
<h3 id="org9adfdc2"><span class="section-number-3">1.32.</span> Make <i>regular expessions</i> in this config more readable</h3>
<div class="outline-text-3" id="text-1-32">
<p>
Regular expessions are powerful, but hard to read. EMACS Lisp regular expressions are even harder to read because of double escaping. But we have <code>rx</code> macro that makes them much more readable. So when I adopt snippets from other sources I try to rewrite them using <code>rx</code>. In order to do that simpler I use xr to generate <code>rx</code> expressions from string representations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'xr<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">xr</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4182a26" class="outline-3">
<h3 id="org4182a26"><span class="section-number-3">1.33.</span> Open files in <i>existing instance</i> of EMACS</h3>
<div class="outline-text-3" id="text-1-33">
<p>
Server mode allows to open files in existing EMACS instance from the
command line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>server-start<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
