README.org
** Define basic leader /keybindings/
I really like the idea of having a leader key flow for essential
commands. It makes keybindings more consistent and easier to discover
when I forget them. Here I set foundation and bind the most essential
commands.

This subsection comes last. It's more natural to have them in one
place in the scope of this section because it allows to see all of
them at once.

#+BEGIN_SRC emacs-lisp
(my-leader-def
  "a" '(:ignore t :which-key "app")
  "a u" #'undo-tree-visualize

  "b" '(:ignore t :which-key "buffer/bookmark")
  "b b" #'consult-buffer
  "b k" #'my-kill-this-buffer
  "b K" #'my-force-kill-this-buffer
  "b C-k" #'my-kill-other-buffers
  "b n" #'next-buffer
  "b p" #'previous-buffer
  "b i" #'ibuffer

  "b m" #'bookmark-set
  "b SPC" #'consult-bookmark
  "b x" #'bookmark-delete
  "b C-x" #'bookmark-delete-all

  "b d" #'dired-jump

  "c" '(:ignore t :which-key "code")

  "e" '(:ignore t :which-key "edit")
  "e s" #'smartparens-mode
  "e [" #'show-smartparens-mode
  "e p" #'consult-yank-from-kill-ring

  "f" '(:ignore t :which-key "file")
  "f f" #'find-file
  "f r" #'consult-recent-file

  "j" '(:ignore t :which-key "jump")
  "j j" #'consult-imenu

  "m" '(:ignore t :which-key "mode")

  "p" '(:ignore t :which-key "project")

  "s" '(:ignore t :which-key "search")

  "t" '(:ignore t :which-key "toggles")
  "t +" #'text-scale-increase
  "t -" #'text-scale-decrease
  "t =" #'my-text-scale-0
  "t b" #'my-text-scale-big

  "t l" #'toggle-truncate-lines
  "t w" #'toggle-word-wrap

  "t n" #'my-switch-line-numbers-mode


  "u" '(:ignore t :which-key "utils")
  "u f" #'my-what-the-face-mode
  "u k" #'keyfreq-show
  "u C-k" #'keyfreq-reset
  )
#+END_SRC

* Make it an IDE
This section is about adding features that make EMACS more like an
IDE. It's language-agnostic and focused on general features that are
useful for any programming language.

** /Project/ management and search
When possible I prefer to use built-in EMACS features. ~project.el~ is
good enough for me, so I use it. It keymap starts with ~C-x p~ and I
often use it as is, but I also want to have essential commands under
my leader keymap.

#+BEGIN_SRC emacs-lisp
(my-leader-def
  "SPC" #'project-find-file
  
  "p p" #'project-switch-project
  "p b" #'consult-project-buffer
  "p k" #'project-kill-buffers)
#+END_SRC

Sometimes I need to copy current position in the project in order to
share with someone or for my notes.

#+BEGIN_SRC emacs-lisp
(defun my-copy-file-path-relative-to-project-root ()
  "Copy the current buffer's file path and line number relative to the project root into the kill ring."
  (interactive)
  (if-let ((file-path (buffer-file-name))
           (project-root (when (project-current) (expand-file-name (project-root (project-current)))))
           (line-number (line-number-at-pos))
           (relative-path (format "%s:%d" (file-relative-name file-path project-root) line-number)))
      (progn
        (kill-new relative-path)
        (message "Copied: %s" relative-path))
    (message "No file associated with buffer or not in a project.")))

(my-leader-def
  "p y" #'my-copy-file-path-relative-to-project-root)
#+END_SRC

Search is a very important part of any IDE. [[https://github.com/BurntSushi/ripgrep][ripgrep]] is my current
favourite search tool. I prefer to use ~consult-ripgrep~ as a simple
frontend and [[https://rgel.readthedocs.io/en/latest/][rg]] as a tool for more complex search scenarios.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'rg)
(require 'rg)

(rg-enable-default-bindings)
(evil-collection-rg-setup)
(evil-collection-wgrep-setup)

(my-leader-def
  "p s" #'consult-ripgrep
  "p S" #'rg-menu)
#+END_SRC

