README.html
<div id="outline-container-org708f88a" class="outline-3">
<h3 id="org708f88a"><span class="section-number-3">1.34.</span> Define basic leader <i>keybindings</i></h3>
<div class="outline-text-3" id="text-1-34">
<p>
I really like the idea of having a leader key flow for essential
commands. It makes keybindings more consistent and easier to discover
when I forget them. Here I set foundation and bind the most essential
commands.
</p>

<p>
This subsection comes last. It's more natural to have them in one
place in the scope of this section because it allows to see all of
them at once.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"a"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"app"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"a u"</span> #'undo-tree-visualize

  <span style="color: #A3BE8C;">"b"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"buffer/bookmark"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"b b"</span> #'consult-buffer
  <span style="color: #A3BE8C;">"b k"</span> #'my-kill-this-buffer
  <span style="color: #A3BE8C;">"b K"</span> #'my-force-kill-this-buffer
  <span style="color: #A3BE8C;">"b C-k"</span> #'my-kill-other-buffers
  <span style="color: #A3BE8C;">"b n"</span> #'next-buffer
  <span style="color: #A3BE8C;">"b p"</span> #'previous-buffer
  <span style="color: #A3BE8C;">"b i"</span> #'ibuffer

  <span style="color: #A3BE8C;">"b m"</span> #'bookmark-set
  <span style="color: #A3BE8C;">"b SPC"</span> #'consult-bookmark
  <span style="color: #A3BE8C;">"b x"</span> #'bookmark-delete
  <span style="color: #A3BE8C;">"b C-x"</span> #'bookmark-delete-all

  <span style="color: #A3BE8C;">"b d"</span> #'dired-jump

  <span style="color: #A3BE8C;">"c"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"code"</span><span style="color: #88C0D0;">)</span>

  <span style="color: #A3BE8C;">"e"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"edit"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"e s"</span> #'smartparens-mode
  <span style="color: #A3BE8C;">"e ["</span> #'show-smartparens-mode
  <span style="color: #A3BE8C;">"e p"</span> #'consult-yank-from-kill-ring

  <span style="color: #A3BE8C;">"f"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"file"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"f f"</span> #'find-file
  <span style="color: #A3BE8C;">"f r"</span> #'consult-recent-file

  <span style="color: #A3BE8C;">"j"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"jump"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"j j"</span> #'consult-imenu

  <span style="color: #A3BE8C;">"m"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"mode"</span><span style="color: #88C0D0;">)</span>

  <span style="color: #A3BE8C;">"p"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"project"</span><span style="color: #88C0D0;">)</span>

  <span style="color: #A3BE8C;">"s"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"search"</span><span style="color: #88C0D0;">)</span>

  <span style="color: #A3BE8C;">"t"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"toggles"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"t +"</span> #'text-scale-increase
  <span style="color: #A3BE8C;">"t -"</span> #'text-scale-decrease
  <span style="color: #A3BE8C;">"t ="</span> #'my-text-scale-0
  <span style="color: #A3BE8C;">"t b"</span> #'my-text-scale-big

  <span style="color: #A3BE8C;">"t l"</span> #'toggle-truncate-lines
  <span style="color: #A3BE8C;">"t w"</span> #'toggle-word-wrap

  <span style="color: #A3BE8C;">"t n"</span> #'my-switch-line-numbers-mode


  <span style="color: #A3BE8C;">"u"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"utils"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"u f"</span> #'my-what-the-face-mode
  <span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9e43688" class="outline-2">
<h2 id="org9e43688"><span class="section-number-2">2.</span> Make it an IDE</h2>
<div class="outline-text-2" id="text-2">
<p>
This section is about adding features that make EMACS more like an
IDE. It's language-agnostic and focused on general features that are
useful for any programming language.
</p>
</div>
<div id="outline-container-orge37bce8" class="outline-3">
<h3 id="orge37bce8"><span class="section-number-3">2.1.</span> <i>Project</i> management and search</h3>
<div class="outline-text-3" id="text-2-1">
<p>
When possible I prefer to use built-in EMACS features. <code>project.el</code> is
good enough for me, so I use it. It keymap starts with <code>C-x p</code> and I
often use it as is, but I also want to have essential commands under
my leader keymap.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"SPC"</span> #'project-find-file
  
  <span style="color: #A3BE8C;">"p p"</span> #'project-switch-project
  <span style="color: #A3BE8C;">"p b"</span> #'consult-project-buffer
  <span style="color: #A3BE8C;">"p k"</span> #'project-kill-buffers<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Sometimes I need to copy current position in the project in order to
share with someone or for my notes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-copy-file-path-relative-to-project-root</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Copy the current buffer's file path and line number relative to the project root into the kill ring."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">if-let</span> <span style="color: #81A1C1;">(</span><span style="color: #5E81AC;">(</span>file-path <span style="color: #D08770;">(</span>buffer-file-name<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
           <span style="color: #5E81AC;">(</span>project-root <span style="color: #D08770;">(</span><span style="color: #81A1C1;">when</span> <span style="color: #EBCB8B;">(</span>project-current<span style="color: #EBCB8B;">)</span> <span style="color: #EBCB8B;">(</span>expand-file-name <span style="color: #A3BE8C;">(</span>project-root <span style="color: #B48EAD;">(</span>project-current<span style="color: #B48EAD;">)</span><span style="color: #A3BE8C;">)</span><span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
           <span style="color: #5E81AC;">(</span>line-number <span style="color: #D08770;">(</span>line-number-at-pos<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
           <span style="color: #5E81AC;">(</span>relative-path <span style="color: #D08770;">(</span>format <span style="color: #A3BE8C;">"%s:%d"</span> <span style="color: #EBCB8B;">(</span>file-relative-name file-path project-root<span style="color: #EBCB8B;">)</span> line-number<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
      <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">progn</span>
        <span style="color: #5E81AC;">(</span>kill-new relative-path<span style="color: #5E81AC;">)</span>
        <span style="color: #5E81AC;">(</span>message <span style="color: #A3BE8C;">"Copied: %s"</span> relative-path<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span>message <span style="color: #A3BE8C;">"No file associated with buffer or not in a project."</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"p y"</span> #'my-copy-file-path-relative-to-project-root<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Search is a very important part of any IDE. <a href="https://github.com/BurntSushi/ripgrep">ripgrep</a> is my current
favourite search tool. I prefer to use <code>consult-ripgrep</code> as a simple
frontend and <a href="https://rgel.readthedocs.io/en/latest/">rg</a> as a tool for more complex search scenarios.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'rg<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">rg</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>rg-enable-default-bindings<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>evil-collection-rg-setup<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>evil-collection-wgrep-setup<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"p s"</span> #'consult-ripgrep
  <span style="color: #A3BE8C;">"p S"</span> #'rg-menu<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
