README.org
** Fast access to /favourite files/
I have a list of files that I use very often. I want to have fast and
easy access to them.

#+BEGIN_SRC emacs-lisp
(defvar my-favourite-files
  '("~/.emacs.d/README.org"
    "~/Work/onboarding.org"
    "~/Desktop/TODO.org"
    "~/Desktop/highlights.org")
  "Important files list")

(defun my-open-favourite-file ()
  "Select and open an important file from my-important-files"
  (interactive)
  (find-file (consult--read
              my-favourite-files
              :prompt "Favourite files: "
              :category 'file
              :sort nil)))

(my-leader-def
  "f F" #'my-open-favourite-file)
#+END_SRC

** /Git/ support
[[https://magit.vc/][magit]] is the best git client. Period. One of the reasons why I cannot
quit using EMACS.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'magit)
(require 'magit)

;; word-granularity diff highlighting
(setq magit-diff-refine-hunk t)

(evil-collection-magit-setup)

(my-leader-def
  "g" '(:ignore t :which-key "git")
  "g SPC" #'magit-dispatch
  "g g" #'magit-status
  "g b" #'magit-blame)
#+END_SRC

By default ~magit~ has no syntax highlighting for diffs. It can be
fixed using [[https://github.com/dandavison/magit-delta][magit-delta]]. Initially I used this article [[https://scripter.co/using-git-delta-with-magit/][Using git-delta
with Magit]] to set it up.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'magit-delta)
(require 'magit-delta)

(setq magit-delta-default-dark-theme "Nord")

(add-hook 'magit-mode-hook (lambda () (magit-delta-mode +1)))
#+END_SRC

[[https://github.com/dgutov/diff-hl/][diff-hl]] is an essential package that highlights changes in the fringe
of the buffer.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'diff-hl)
(setq diff-hl-show-staged-changes nil)
(require 'diff-hl)

(global-diff-hl-mode)
#+END_SRC

I need support for git-related files. [[https://github.com/magit/git-modes/][git-modes]] provides it.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'git-modes)
(require 'git-modes)
#+END_SRC

Sometimes I can use EMACS's built-in ~vc~ package. So I need to
"vimify" it.

#+BEGIN_SRC emacs-lisp
(evil-collection-vc-git-setup)
#+END_SRC

** /Terminal/ support
Usually I use a separate terminal emulator, but sometimes I need to
use terminal started from EMACS. In a such case I prefer to use [[https://github.com/akermu/emacs-libvterm][vterm]].

#+BEGIN_SRC emacs-lisp
(straight-use-package 'vterm)
(require 'vterm)

(evil-collection-vterm-setup)

(my-leader-def
  "a t" #'vterm)
#+END_SRC

