README.html
<div id="outline-container-org2cdd254" class="outline-3">
<h3 id="org2cdd254"><span class="section-number-3">2.2.</span> Fast access to <i>favourite files</i></h3>
<div class="outline-text-3" id="text-2-2">
<p>
I have a list of files that I use very often. I want to have fast and
easy access to them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defvar</span> <span style="color: #D8DEE9;">my-favourite-files</span>
  '<span style="color: #88C0D0;">(</span><span style="color: #A3BE8C;">"~/.emacs.d/README.org"</span>
    <span style="color: #A3BE8C;">"~/Work/onboarding.org"</span>
    <span style="color: #A3BE8C;">"~/Desktop/TODO.org"</span>
    <span style="color: #A3BE8C;">"~/Desktop/highlights.org"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #616e88;">"Important files list"</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-open-favourite-file</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Select and open an important file from my-important-files"</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span>find-file <span style="color: #81A1C1;">(</span>consult--read
              my-favourite-files
              <span style="color: #81A1C1;">:prompt</span> <span style="color: #A3BE8C;">"Favourite files: "</span>
              <span style="color: #81A1C1;">:category</span> 'file
              <span style="color: #81A1C1;">:sort</span> nil<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"f F"</span> #'my-open-favourite-file<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4702652" class="outline-3">
<h3 id="org4702652"><span class="section-number-3">2.3.</span> <i>Git</i> support</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="https://magit.vc/">magit</a> is the best git client. Period. One of the reasons why I cannot
quit using EMACS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'magit<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">magit</span><span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">word-granularity diff highlighting</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> magit-diff-refine-hunk t<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>evil-collection-magit-setup<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"g"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"git"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"g SPC"</span> #'magit-dispatch
  <span style="color: #A3BE8C;">"g g"</span> #'magit-status
  <span style="color: #A3BE8C;">"g b"</span> #'magit-blame<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
By default <code>magit</code> has no syntax highlighting for diffs. It can be
fixed using <a href="https://github.com/dandavison/magit-delta">magit-delta</a>. Initially I used this article <a href="https://scripter.co/using-git-delta-with-magit/">Using git-delta
with Magit</a> to set it up.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'magit-delta<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">magit-delta</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> magit-delta-default-dark-theme <span style="color: #A3BE8C;">"Nord"</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'magit-mode-hook <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">lambda</span> <span style="color: #81A1C1;">()</span> <span style="color: #81A1C1;">(</span>magit-delta-mode +1<span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<a href="https://github.com/dgutov/diff-hl/">diff-hl</a> is an essential package that highlights changes in the fringe
of the buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'diff-hl<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> diff-hl-show-staged-changes nil<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">diff-hl</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>global-diff-hl-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
I need support for git-related files. <a href="https://github.com/magit/git-modes/">git-modes</a> provides it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'git-modes<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">git-modes</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Sometimes I can use EMACS's built-in <code>vc</code> package. So I need to
"vimify" it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>evil-collection-vc-git-setup<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge2a5487" class="outline-3">
<h3 id="orge2a5487"><span class="section-number-3">2.4.</span> <i>Terminal</i> support</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Usually I use a separate terminal emulator, but sometimes I need to
use terminal started from EMACS. In a such case I prefer to use <a href="https://github.com/akermu/emacs-libvterm">vterm</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'vterm<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">vterm</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>evil-collection-vterm-setup<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"a t"</span> #'vterm<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
