README.org
** Enable /autocompletion/
Autocompletion is a must-have feature for any IDE. I prefer to use
[[https://github.com/minad/corfu][corfu]] and [[https://github.com/minad/cape][cape]] because they have better integration with EMACS
built-in completion system.

First step is to enable ~corfu~.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'corfu)
(setq corfu-auto t
      corfu-preview-current nil
      corfu-auto-delay 1.0)
(require 'corfu)

(global-corfu-mode)
(evil-collection-corfu-setup)

;; while in autocompletion press <tab> to mimic orderless behaviour
;; (orderless search by multiple regexps in any order)
(general-def :keymaps 'corfu-map
  (kbd "<tab>") #'corfu-insert-separator)
#+END_SRC

~corfu~ has several extensions. I need fancy popup with documentation!

#+BEGIN_SRC emacs-lisp
(require 'corfu-popupinfo)
(setq corfu-popupinfo-delay (cons 0.5 0.1))
(corfu-popupinfo-mode)

(my-leader-def
  "t p" #'corfu-popupinfo-mode)
#+END_SRC

UI can be improved by adding icons to the completion popup.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'kind-icon)
(require 'kind-icon)

(add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter)
#+END_SRC

And now it's time to enable ~cape~ and bind my auto-completion flow to
C-<tab>-based keybindings.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'cape)
(require 'cape)

(add-to-list 'completion-at-point-functions #'cape-dabbrev)
(add-to-list 'completion-at-point-functions #'cape-file)

(general-def :keymaps 'evil-insert-state-map
  "C-<tab> C-<tab>" #'completion-at-point
  "C-<tab> f" #'cape-file
  "C-<tab> d" #'cape-dabbrev
  "C-<tab> w" #'cape-dict
  "C-<tab> l" #'cape-line)
#+END_SRC

** Enable /snippets/
Snippets are very useful when you need to write a lot of
boilerplate. But someone's snippets are useless for me - I need to
write my own in order to remember them better. I haven't found
yasnippet's format and approach inconvenient and found [[https://github.com/minad/tempel][tempel]].

I like Lisp-data format for snippets and being able to add multiple
templates in one file for multiple modes. So I can define snippets in
a tangled code block in this document, especially in language-specific
subsections. It's much better for me than yasnippet's approach with
separate files for each snippet.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'tempel)
(setq tempel-path '("~/.emacs.d/templates.eld" "~/.emacs.d/templates_private.eld"))
(require 'tempel)

(defun my-tempel-setup-capf ()
  "Add the Tempel Capf to the beginning of `completion-at-point-functions'."
  (setq-local completion-at-point-functions
              (cons #'tempel-complete
                    (remove 'tempel-complete completion-at-point-functions))))

(add-hook 'conf-mode-hook 'my-tempel-setup-capf)
(add-hook 'prog-mode-hook 'my-tempel-setup-capf)
(add-hook 'text-mode-hook 'my-tempel-setup-capf)
(add-hook 'eglot-managed-mode-hook 'my-tempel-setup-capf)

(my-leader-def
  "e s" #'tempel-insert)
#+END_SRC

Global snippets (~templates.eld~):

#+BEGIN_SRC lisp-data :tangle templates.eld
fundamental-mode ;; Available everywhere

(today (format-time-string "%Y-%m-%d"))

prog-mode

(fixme (if (derived-mode-p 'emacs-lisp-mode) ";; " comment-start) "FIXME ")
(todo (if (derived-mode-p 'emacs-lisp-mode) ";; " comment-start) "TODO ")
(bug (if (derived-mode-p 'emacs-lisp-mode) ";; " comment-start) "BUG ")
(hack (if (derived-mode-p 'emacs-lisp-mode) ";; " comment-start) "HACK ")
#+END_SRC

** Enable /Language Server/ support
Language Servers support is a must-have feature for any modern IDE. I
prefer to use [[https://joaotavora.github.io/eglot/][eglot]] because it has better integration with EMACS
built-in completion system and other features.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'eglot)
(setq jsonrpc-default-request-timeout 20) ;; for heavy projects
(require 'eglot)
#+END_SRC

LSP-powered project-wide symbol search can be very useful:

#+BEGIN_SRC emacs-lisp
(straight-use-package 'consult-eglot)
(require 'consult-eglot)

(my-leader-def
  "j SPC" #'consult-eglot-symbols)
#+END_SRC

