README.html
<div id="outline-container-org40b8d45" class="outline-3">
<h3 id="org40b8d45"><span class="section-number-3">2.5.</span> Enable <i>autocompletion</i></h3>
<div class="outline-text-3" id="text-2-5">
<p>
Autocompletion is a must-have feature for any IDE. I prefer to use
<a href="https://github.com/minad/corfu">corfu</a> and <a href="https://github.com/minad/cape">cape</a> because they have better integration with EMACS
built-in completion system.
</p>

<p>
First step is to enable <code>corfu</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'corfu<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> corfu-auto t
      corfu-preview-current nil
      corfu-auto-delay 1.0<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">corfu</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>global-corfu-mode<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>evil-collection-corfu-setup<span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">while in autocompletion press &lt;tab&gt; to mimic orderless behaviour</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">(orderless search by multiple regexps in any order)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-def</span> <span style="color: #81A1C1;">:keymaps</span> 'corfu-map
  <span style="color: #88C0D0;">(</span>kbd <span style="color: #A3BE8C;">"&lt;tab&gt;"</span><span style="color: #88C0D0;">)</span> #'corfu-insert-separator<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
<code>corfu</code> has several extensions. I need fancy popup with documentation!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">corfu-popupinfo</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> corfu-popupinfo-delay <span style="color: #88C0D0;">(</span>cons 0.5 0.1<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>corfu-popupinfo-mode<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"t p"</span> #'corfu-popupinfo-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
UI can be improved by adding icons to the completion popup.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'kind-icon<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">kind-icon</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
And now it's time to enable <code>cape</code> and bind my auto-completion flow to
C-&lt;tab&gt;-based keybindings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'cape<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">cape</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-to-list 'completion-at-point-functions #'cape-dabbrev<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-to-list 'completion-at-point-functions #'cape-file<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-def</span> <span style="color: #81A1C1;">:keymaps</span> 'evil-insert-state-map
  <span style="color: #A3BE8C;">"C-&lt;tab&gt; C-&lt;tab&gt;"</span> #'completion-at-point
  <span style="color: #A3BE8C;">"C-&lt;tab&gt; f"</span> #'cape-file
  <span style="color: #A3BE8C;">"C-&lt;tab&gt; d"</span> #'cape-dabbrev
  <span style="color: #A3BE8C;">"C-&lt;tab&gt; w"</span> #'cape-dict
  <span style="color: #A3BE8C;">"C-&lt;tab&gt; l"</span> #'cape-line<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7df407f" class="outline-3">
<h3 id="org7df407f"><span class="section-number-3">2.6.</span> Enable <i>snippets</i></h3>
<div class="outline-text-3" id="text-2-6">
<p>
Snippets are very useful when you need to write a lot of
boilerplate. But someone's snippets are useless for me - I need to
write my own in order to remember them better. I haven't found
yasnippet's format and approach inconvenient and found <a href="https://github.com/minad/tempel">tempel</a>.
</p>

<p>
I like Lisp-data format for snippets and being able to add multiple
templates in one file for multiple modes. So I can define snippets in
a tangled code block in this document, especially in language-specific
subsections. It's much better for me than yasnippet's approach with
separate files for each snippet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'tempel<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> tempel-path '<span style="color: #88C0D0;">(</span><span style="color: #A3BE8C;">"~/.emacs.d/templates.eld"</span> <span style="color: #A3BE8C;">"~/.emacs.d/templates_private.eld"</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">tempel</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-tempel-setup-capf</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Add the Tempel Capf to the beginning of `</span><span style="color: #81A1C1;">completion-at-point-functions</span><span style="color: #616e88;">'."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">setq-local</span> completion-at-point-functions
              <span style="color: #81A1C1;">(</span>cons #'tempel-complete
                    <span style="color: #5E81AC;">(</span>remove 'tempel-complete completion-at-point-functions<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'conf-mode-hook 'my-tempel-setup-capf<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'prog-mode-hook 'my-tempel-setup-capf<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'text-mode-hook 'my-tempel-setup-capf<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'eglot-managed-mode-hook 'my-tempel-setup-capf<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"e s"</span> #'tempel-insert<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Global snippets (<code>templates.eld</code>):
</p>

<div class="org-src-container">
<pre class="src src-lisp-data">fundamental-mode <span style="color: #616e88;">;; </span><span style="color: #616e88;">Available everywhere</span>

(today (format-time-string <span style="color: #A3BE8C;">"%Y-%m-%d"</span>))

prog-mode

(fixme (<span style="color: #81A1C1;">if</span> (derived-mode-p 'emacs-lisp-mode) <span style="color: #A3BE8C;">";; "</span> comment-start) <span style="color: #A3BE8C;">"FIXME "</span>)
(todo (<span style="color: #81A1C1;">if</span> (derived-mode-p 'emacs-lisp-mode) <span style="color: #A3BE8C;">";; "</span> comment-start) <span style="color: #A3BE8C;">"TODO "</span>)
(bug (<span style="color: #81A1C1;">if</span> (derived-mode-p 'emacs-lisp-mode) <span style="color: #A3BE8C;">";; "</span> comment-start) <span style="color: #A3BE8C;">"BUG "</span>)
(hack (<span style="color: #81A1C1;">if</span> (derived-mode-p 'emacs-lisp-mode) <span style="color: #A3BE8C;">";; "</span> comment-start) <span style="color: #A3BE8C;">"HACK "</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org361dfc4" class="outline-3">
<h3 id="org361dfc4"><span class="section-number-3">2.7.</span> Enable <i>Language Server</i> support</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Language Servers support is a must-have feature for any modern IDE. I
prefer to use <a href="https://joaotavora.github.io/eglot/">eglot</a> because it has better integration with EMACS
built-in completion system and other features.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'eglot<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">eglot</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
LSP-powered project-wide symbol search can be very useful:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'consult-eglot<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">consult-eglot</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"j SPC"</span> #'consult-eglot-symbols<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
