README.org
** Retrieve secrets from /passwod manager/
For CLI apps and EMACS I prefer to use [[https://www.passwordstore.org/][pass]] as a password manager
instead of 1Password or alternatives. I need to have a convinient way
to retrieve secrets from it.

#+BEGIN_SRC emacs-lisp
(defun my-get-pass (name)
  "Retrieve secret under NAME from Pass."
  (let ((pass-command (concat "pass " name)))
    (string-trim (shell-command-to-string pass-command))))
#+END_SRC

** Opt-in switch to /GitHub Copilot/ completion
Copilot is a code completion engine that uses OpenAI's GPT. In some
cases it significantly improves my productivity. I prefer to not mix
it with other completion engines and use it as a separate one by
switching to it when needed.

#+BEGIN_SRC emacs-lisp
(straight-use-package '(copilot :host github :repo "copilot-emacs/copilot.el" :files ("*.el")))

;; copilot.el requires nodejs to be installed, but I don't want to
;; install it globally so I'm using Nix to link non-globally installed
;; nodejs binaries to ~/.emacs.d/nodejs-bin
(setq exec-path (append exec-path
                        (list (s-concat (getenv "HOME") "/.emacs.d/nodejs-bin"))))
(setq copilot-indent-offset-warning-disable t)
(require 'copilot)

(defun toggle-copilot ()
  "Toggles between Copilot and Corfu completion engines."
  (interactive)
  (if corfu-mode
      (progn
        ;; close auto-completion popup if enabled
        (corfu-quit)
        (corfu-mode -1)
        (copilot-mode 1)
        (message "Copilot enabled"))
    (progn
      (copilot-mode -1)
      (corfu-mode 1)
      (message "Copilot disabled"))))

(my-leader-def
  "t c" #'toggle-copilot)

(general-def
  "s-j" #'toggle-copilot)

(general-def
  :states '(insert)
  :keymaps 'copilot-mode-map
  "s-<return>" #'copilot-accept-completion
  "C-s-<return>" #'copilot-accept-completion-by-word
  "C-s-j" #'copilot-next-completion
  "C-s-k" #'copilot-previous-completion)
#+END_SRC

** Get assistance from /LLMs/ 
It's convenient to have an ability to get assistance from LLMs without
leaving EMACS. [[https://github.com/karthink/gptel][gptel]] is a package that allows to do it. I have to load
it after ~markdown-mode~ because I want my GPT sessions in Markdown
format.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'gptel)
(setq-default gptel-model "gpt-4o")
(setq gptel-api-key (my-get-pass "openai/api_key"))

(with-eval-after-load 'markdown-mode
  (require 'gptel)

  (add-hook 'gptel-mode-hook #'toggle-word-wrap))

(my-leader-def
  "a g" #'gptel)
#+END_SRC

** /REST/ client
Often using CURL is not convinient but Postman is overkill. So I need
some simple and declarative way to describe HTTP requests and run
them. [[https://github.com/pashky/restclient.el][restclient]] do the job and I haven't found any better package for
this.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'restclient)
(require 'restclient)

(add-to-list 'auto-mode-alist
             `(,(rx ".restclient" eos) . restclient-mode))
#+END_SRC

** Support /direnv/ environments
direnv is a great tool that allows to manage directory-local
environments and hooks. I need to have a convinient way to load them
in EMACS. [[https://github.com/purcell/envrc][envrc]] is a package that does the job.

It should be loaded as late as possible because:

> It's probably wise to do this late in your startup sequence: you
normally want envrc-mode to be initialized in each buffer before other
minor modes like flycheck-mode which might look for
executables. Counter-intuitively, this means that envrc-global-mode
should be enabled after other global minor modes, since each prepends
itself to various hooks. /(From
https://github.com/purcell/envrc/tree/master)/

#+BEGIN_SRC emacs-lisp
(straight-use-package 'envrc)
(require 'envrc)

(add-hook 'after-init-hook #'envrc-global-mode)
#+END_SRC

