README.html
<div id="outline-container-org36de831" class="outline-3">
<h3 id="org36de831"><span class="section-number-3">2.8.</span> Retrieve secrets from <i>passwod manager</i></h3>
<div class="outline-text-3" id="text-2-8">
<p>
For CLI apps and EMACS I prefer to use <a href="https://www.passwordstore.org/">pass</a> as a password manager
instead of 1Password or alternatives. I need to have a convinient way
to retrieve secrets from it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-get-pass</span> <span style="color: #88C0D0;">(</span>name<span style="color: #88C0D0;">)</span>
  <span style="color: #616e88;">"Retrieve secret under NAME from Pass."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">let</span> <span style="color: #81A1C1;">(</span><span style="color: #5E81AC;">(</span>pass-command <span style="color: #D08770;">(</span>concat <span style="color: #A3BE8C;">"pass "</span> name<span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span>string-trim <span style="color: #5E81AC;">(</span>shell-command-to-string pass-command<span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9d6020a" class="outline-3">
<h3 id="org9d6020a"><span class="section-number-3">2.9.</span> Opt-in switch to <i>GitHub Copilot</i> completion</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Copilot is a code completion engine that uses OpenAI's GPT. In some
cases it significantly improves my productivity. I prefer to not mix
it with other completion engines and use it as a separate one by
switching to it when needed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package '<span style="color: #88C0D0;">(</span>copilot <span style="color: #81A1C1;">:host</span> github <span style="color: #81A1C1;">:repo</span> <span style="color: #A3BE8C;">"copilot-emacs/copilot.el"</span> <span style="color: #81A1C1;">:files</span> <span style="color: #81A1C1;">(</span><span style="color: #A3BE8C;">"*.el"</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #616e88;">;; </span><span style="color: #616e88;">copilot.el requires nodejs to be installed, but I don't want to</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">install it globally so I'm using Nix to link non-globally installed</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">nodejs binaries to ~/.emacs.d/nodejs-bin</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> exec-path <span style="color: #88C0D0;">(</span>append exec-path
                        <span style="color: #81A1C1;">(</span>list <span style="color: #5E81AC;">(</span>s-concat <span style="color: #D08770;">(</span>getenv <span style="color: #A3BE8C;">"HOME"</span><span style="color: #D08770;">)</span> <span style="color: #A3BE8C;">"/.emacs.d/nodejs-bin"</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> copilot-indent-offset-warning-disable t<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">copilot</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">toggle-copilot</span> <span style="color: #88C0D0;">()</span>
  <span style="color: #616e88;">"Toggles between Copilot and Corfu completion engines."</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">interactive</span><span style="color: #88C0D0;">)</span>
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">if</span> corfu-mode
      <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">progn</span>
        <span style="color: #616e88;">;; </span><span style="color: #616e88;">close auto-completion popup if enabled</span>
        <span style="color: #5E81AC;">(</span>corfu-quit<span style="color: #5E81AC;">)</span>
        <span style="color: #5E81AC;">(</span>corfu-mode -1<span style="color: #5E81AC;">)</span>
        <span style="color: #5E81AC;">(</span>copilot-mode 1<span style="color: #5E81AC;">)</span>
        <span style="color: #5E81AC;">(</span>message <span style="color: #A3BE8C;">"Copilot enabled"</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">progn</span>
      <span style="color: #5E81AC;">(</span>copilot-mode -1<span style="color: #5E81AC;">)</span>
      <span style="color: #5E81AC;">(</span>corfu-mode 1<span style="color: #5E81AC;">)</span>
      <span style="color: #5E81AC;">(</span>message <span style="color: #A3BE8C;">"Copilot disabled"</span><span style="color: #5E81AC;">)</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"t c"</span> #'toggle-copilot<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-def</span>
  <span style="color: #A3BE8C;">"s-j"</span> #'toggle-copilot<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">general-def</span>
  <span style="color: #81A1C1;">:states</span> '<span style="color: #88C0D0;">(</span>insert<span style="color: #88C0D0;">)</span>
  <span style="color: #81A1C1;">:keymaps</span> 'copilot-mode-map
  <span style="color: #A3BE8C;">"s-&lt;return&gt;"</span> #'copilot-accept-completion
  <span style="color: #A3BE8C;">"C-s-&lt;return&gt;"</span> #'copilot-accept-completion-by-word
  <span style="color: #A3BE8C;">"C-s-j"</span> #'copilot-next-completion
  <span style="color: #A3BE8C;">"C-s-k"</span> #'copilot-previous-completion<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcbf5966" class="outline-3">
<h3 id="orgcbf5966"><span class="section-number-3">2.10.</span> Get assistance from <i>LLMs</i></h3>
<div class="outline-text-3" id="text-2-10">
<p>
It's convenient to have an ability to get assistance from LLMs without
leaving EMACS. <a href="https://github.com/karthink/gptel">gptel</a> is a package that allows to do it. I have to load
it after <code>markdown-mode</code> because I want my GPT sessions in Markdown
format.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'gptel<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq-default</span> gptel-model <span style="color: #A3BE8C;">"gpt-4o"</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> gptel-api-key <span style="color: #88C0D0;">(</span>my-get-pass <span style="color: #A3BE8C;">"openai/api_key"</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">with-eval-after-load</span> 'markdown-mode
  <span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">gptel</span><span style="color: #88C0D0;">)</span>

  <span style="color: #88C0D0;">(</span>add-hook 'gptel-mode-hook #'toggle-word-wrap<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"a g"</span> #'gptel<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge5562bd" class="outline-3">
<h3 id="orge5562bd"><span class="section-number-3">2.11.</span> <i>REST</i> client</h3>
<div class="outline-text-3" id="text-2-11">
<p>
Often using CURL is not convinient but Postman is overkill. So I need
some simple and declarative way to describe HTTP requests and run
them. <a href="https://github.com/pashky/restclient.el">restclient</a> do the job and I haven't found any better package for
this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'restclient<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">restclient</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-to-list 'auto-mode-alist
             `<span style="color: #88C0D0;">(</span>,<span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">rx</span> <span style="color: #A3BE8C;">".restclient"</span> eos<span style="color: #81A1C1;">)</span> . restclient-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2a74a5b" class="outline-3">
<h3 id="org2a74a5b"><span class="section-number-3">2.12.</span> Support <i>direnv</i> environments</h3>
<div class="outline-text-3" id="text-2-12">
<p>
direnv is a great tool that allows to manage directory-local
environments and hooks. I need to have a convinient way to load them
in EMACS. <a href="https://github.com/purcell/envrc">envrc</a> is a package that does the job.
</p>

<p>
It should be loaded as late as possible because:
</p>

<p>
&gt; It's probably wise to do this late in your startup sequence: you
normally want envrc-mode to be initialized in each buffer before other
minor modes like flycheck-mode which might look for
executables. Counter-intuitively, this means that envrc-global-mode
should be enabled after other global minor modes, since each prepends
itself to various hooks. <i>(From
<a href="https://github.com/purcell/envrc/tree/master">https://github.com/purcell/envrc/tree/master</a>)</i>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'envrc<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">envrc</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'after-init-hook #'envrc-global-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
