README.org
** Open fancy /dashboard/ on startup
Usually IDEs have a welcome screen that shows recent projects etc. I
found [[https://github.com/emacs-dashboard/emacs-dashboard][dashboard]] package that does the same for EMACS.

#+BEGIN_SRC emacs-lisp
;; install optional requirements
(straight-use-package 'page-break-lines)
(require 'page-break-lines)

(straight-use-package 'all-the-icons)
(require 'all-the-icons)

(straight-use-package 'dashboard)
(setq dashboard-startup-banner "~/.emacs.d/logo.png")
(require 'dashboard)

(dashboard-setup-startup-hook)
#+END_SRC

* Make it work with...
Now it's time to add support for specific languages and tools. I
prefer to configure them in separate subsections.

** Nix
I use [[https://nixos.org/][nix]] for development shells and declarative package & dotfiles
management.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'nix-ts-mode)
(require 'nix-ts-mode)

(add-to-list 'auto-mode-alist
             `(,(rx ".nix" eos) . nix-ts-mode))

(add-to-list 'eglot-server-programs
             '(nix-ts-mode . ("nixd")))
(add-hook 'nix-ts-mode-hook #'eglot-ensure)
#+END_SRC

** Elixir
[[https://elixir-lang.org/][Elixir]] is my favourite programming language. I prefer to use
tree-sitter-based modes for it.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'heex-ts-mode)
(require 'heex-ts-mode)

(straight-use-package 'elixir-ts-mode)
(require 'elixir-ts-mode)

(add-to-list 'eglot-server-programs
             '(elixir-ts-mode . ("lexical")))
(add-hook 'elixir-ts-mode-hook
          #'eglot-ensure)
#+END_SRC

I need to have a convinient way to run tests from EMACS.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'exunit)
(require 'exunit)

(add-hook 'elixir-ts-mode-hook #'exunit-mode)
#+END_SRC

Language-specific leader keybindings:

#+BEGIN_SRC emacs-lisp
(my-leader-def
  :keymaps 'elixir-ts-mode-map
  :major-modes t
  "m" '(:ignore t :which-key "elixir")
  "m t" #'exunit-transient)
#+END_SRC

Snippets for ~templates.eld~:

#+BEGIN_SRC lisp-data :tangle templates.eld
elixir-ts-mode

(desc "describe \"" (s name) "\" do" n>
      r> n>
      "end" >)

(test "test \"" (s name) "\" do" n>
      r> n>
      "end" >)

(def "def " (s name) "(" (s args) ") do" n>
     r> n>
     "end" >)

(defp "defp " (s name) "(" (s args) ") do" n>
      r> n>
      "end" >)

(defm "defmodule " (s name) " do" n>
      r> n>
      "end" >)

(defts "defmodule " (s name) " do" n>
       "use TypedStruct" n>
       n>
       "typedstruct " (s opts) "do" n>
       r> n>
       "end" n>
       "end" >)

heex-ts-mode

(div "<div>" r> "</div>")
(divc "<div class=\"" (s classes) "\">" n>
      r> n>
      "</div>" >)

(p "<p>" r> "</p>")
(strong "<strong>" r> "</strong>")
(h1 "<h1>" r> "</h1>")
(h2 "<h2>" r> "</h2>")
(h3 "<h3>" r> "</h3>")
(h4 "<h4>" r> "</h4>")
(h5 "<h5>" r> "</h5>")
(h6 "<h6>" r> "</h6>")
#+END_SRC

** EMACS Lisp
This whole configuration is about EMACS Lisp, so I need to take care
of convinient development experience. Enabling rainbow delimiters is a
must have for parentheses-heavy language.

#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook #'rainbow-delimiters-mode)
#+END_SRC

