README.html
<div id="outline-container-orgc3a2247" class="outline-3">
<h3 id="orgc3a2247"><span class="section-number-3">2.13.</span> Open fancy <i>dashboard</i> on startup</h3>
<div class="outline-text-3" id="text-2-13">
<p>
Usually IDEs have a welcome screen that shows recent projects etc. I
found <a href="https://github.com/emacs-dashboard/emacs-dashboard">dashboard</a> package that does the same for EMACS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">install optional requirements</span>
<span style="color: #8FBCBB;">(</span>straight-use-package 'page-break-lines<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">page-break-lines</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>straight-use-package 'all-the-icons<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">all-the-icons</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>straight-use-package 'dashboard<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> dashboard-startup-banner <span style="color: #A3BE8C;">"~/.emacs.d/logo.png"</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">dashboard</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>dashboard-setup-startup-hook<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org94e3a22" class="outline-2">
<h2 id="org94e3a22"><span class="section-number-2">3.</span> Make it work with&#x2026;</h2>
<div class="outline-text-2" id="text-3">
<p>
Now it's time to add support for specific languages and tools. I
prefer to configure them in separate subsections.
</p>
</div>
<div id="outline-container-org8c86a26" class="outline-3">
<h3 id="org8c86a26"><span class="section-number-3">3.1.</span> Nix</h3>
<div class="outline-text-3" id="text-3-1">
<p>
I use <a href="https://nixos.org/">nix</a> for development shells and declarative package &amp; dotfiles
management.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'nix-mode<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">nix-mode</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-to-list 'auto-mode-alist
             `<span style="color: #88C0D0;">(</span>,<span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">rx</span> <span style="color: #A3BE8C;">".nix"</span> eos<span style="color: #81A1C1;">)</span> . nix-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-to-list 'eglot-server-programs
             '<span style="color: #88C0D0;">(</span>nix-mode . <span style="color: #81A1C1;">(</span><span style="color: #A3BE8C;">"nixd"</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'nix-mode-hook #'eglot-ensure<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9b768a0" class="outline-3">
<h3 id="org9b768a0"><span class="section-number-3">3.2.</span> Elixir</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="https://elixir-lang.org/">Elixir</a> is my favourite programming language. I prefer to use
tree-sitter-based modes for it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'heex-ts-mode<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">heex-ts-mode</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>straight-use-package 'elixir-ts-mode<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">elixir-ts-mode</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-to-list 'eglot-server-programs
             '<span style="color: #88C0D0;">(</span>elixir-ts-mode . <span style="color: #81A1C1;">(</span><span style="color: #A3BE8C;">"lexical"</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'elixir-ts-mode-hook
          #'eglot-ensure<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
I need to have a convinient way to run tests from EMACS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'exunit<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">exunit</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'elixir-ts-mode-hook #'exunit-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Language-specific leader keybindings:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #81A1C1;">:keymaps</span> 'elixir-ts-mode-map
  <span style="color: #81A1C1;">:major-modes</span> t
  <span style="color: #A3BE8C;">"m"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"elixir"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"m t"</span> #'exunit-transient<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Snippets for <code>templates.eld</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp-data">elixir-ts-mode

(desc <span style="color: #A3BE8C;">"describe \""</span> (s name) <span style="color: #A3BE8C;">"\" do"</span> n&gt;
      r&gt; n&gt;
      <span style="color: #A3BE8C;">"end"</span> &gt;)

(test <span style="color: #A3BE8C;">"test \""</span> (s name) <span style="color: #A3BE8C;">"\" do"</span> n&gt;
      r&gt; n&gt;
      <span style="color: #A3BE8C;">"end"</span> &gt;)

(def <span style="color: #A3BE8C;">"def "</span> (s name) <span style="color: #A3BE8C;">"("</span> (s args) <span style="color: #A3BE8C;">") do"</span> n&gt;
     r&gt; n&gt;
     <span style="color: #A3BE8C;">"end"</span> &gt;)

(defp <span style="color: #A3BE8C;">"defp "</span> (s name) <span style="color: #A3BE8C;">"("</span> (s args) <span style="color: #A3BE8C;">") do"</span> n&gt;
      r&gt; n&gt;
      <span style="color: #A3BE8C;">"end"</span> &gt;)

(defm <span style="color: #A3BE8C;">"defmodule "</span> (s name) <span style="color: #A3BE8C;">" do"</span> n&gt;
      r&gt; n&gt;
      <span style="color: #A3BE8C;">"end"</span> &gt;)

(defts <span style="color: #A3BE8C;">"defmodule "</span> (s name) <span style="color: #A3BE8C;">" do"</span> n&gt;
       <span style="color: #A3BE8C;">"use TypedStruct"</span> n&gt;
       n&gt;
       <span style="color: #A3BE8C;">"typedstruct "</span> (s opts) <span style="color: #A3BE8C;">"do"</span> n&gt;
       r&gt; n&gt;
       <span style="color: #A3BE8C;">"end"</span> n&gt;
       <span style="color: #A3BE8C;">"end"</span> &gt;)

heex-ts-mode

(div <span style="color: #A3BE8C;">"&lt;div&gt;"</span> r&gt; <span style="color: #A3BE8C;">"&lt;/div&gt;"</span>)
(divc <span style="color: #A3BE8C;">"&lt;div class=\""</span> (s classes) <span style="color: #A3BE8C;">"\"&gt;"</span> n&gt;
      r&gt; n&gt;
      <span style="color: #A3BE8C;">"&lt;/div&gt;"</span> &gt;)

(p <span style="color: #A3BE8C;">"&lt;p&gt;"</span> r&gt; <span style="color: #A3BE8C;">"&lt;/p&gt;"</span>)
(strong <span style="color: #A3BE8C;">"&lt;strong&gt;"</span> r&gt; <span style="color: #A3BE8C;">"&lt;/strong&gt;"</span>)
(h1 <span style="color: #A3BE8C;">"&lt;h1&gt;"</span> r&gt; <span style="color: #A3BE8C;">"&lt;/h1&gt;"</span>)
(h2 <span style="color: #A3BE8C;">"&lt;h2&gt;"</span> r&gt; <span style="color: #A3BE8C;">"&lt;/h2&gt;"</span>)
(h3 <span style="color: #A3BE8C;">"&lt;h3&gt;"</span> r&gt; <span style="color: #A3BE8C;">"&lt;/h3&gt;"</span>)
(h4 <span style="color: #A3BE8C;">"&lt;h4&gt;"</span> r&gt; <span style="color: #A3BE8C;">"&lt;/h4&gt;"</span>)
(h5 <span style="color: #A3BE8C;">"&lt;h5&gt;"</span> r&gt; <span style="color: #A3BE8C;">"&lt;/h5&gt;"</span>)
(h6 <span style="color: #A3BE8C;">"&lt;h6&gt;"</span> r&gt; <span style="color: #A3BE8C;">"&lt;/h6&gt;"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb486db2" class="outline-3">
<h3 id="orgb486db2"><span class="section-number-3">3.3.</span> EMACS Lisp</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This whole configuration is about EMACS Lisp, so I need to take care
of convinient development experience. Enabling rainbow delimiters is a
must have for parentheses-heavy language.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>add-hook 'emacs-lisp-mode-hook #'rainbow-delimiters-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
