README.org
** Ruby
[[https://www.ruby-lang.org/en/][Ruby]] was my favorite programming language before Elixir. I still use
it, like it and need to have a good support for it.

Unfortunately ~ruby-mode~ still has better syntax highlighting then
~ruby-ts-mode~.

#+BEGIN_SRC emacs-lisp
(require 'ruby-mode)
(add-hook 'ruby-mode-hook #'eglot-ensure)
#+END_SRC

Support for RSpec and Minitest are essential.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'rspec-mode)
(require 'rspec-mode)

(straight-use-package 'minitest)
(require 'minitest)
#+END_SRC

Language-specific leader keybindings:

#+BEGIN_SRC emacs-lisp
(my-leader-def
  :keymaps 'ruby-mode-map
  :major-modes t
  "m" '(:ignore t :which-key "ruby")
  "m t" #'rspec-mode-keymap
  "m m" '(:ignore t :which-key "minitest")
  "m m v" #'minitest-verify
  "m m s" #'minitest-verify-single
  "m m t" #'minitest-toggle-test-and-target
  "m m r" #'minitest-rerun
  "m m a" #'minitest-verify-all)
#+END_SRC

** JSON
JSON files are everywhere! I prefer to use tree-sitter-based mode
instead of built-in ~js-json-mode~.

#+BEGIN_SRC emacs-lisp
(add-to-list 'major-mode-remap-alist '(js-json-mode . json-ts-mode))
#+END_SRC

** YAML
YAML files are everywhere too! I prefer to use built-in
tree-sitter-based mode.

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist `(,(rx ".ya" (? "m") "l" eos) . yaml-ts-mode))
#+END_SRC

** ORG
[[https://orgmode.org/][Org-mode]] is the decent way to write notes, documentation and even this
config. It's already loaded earlier in this document so here I just
tailor it to my needs.

#+BEGIN_SRC emacs-lisp
(setq org-startup-indented t
      org-src-preserve-indentation t
      org-html-head-include-scripts nil
      org-pretty-entities t)

(evil-collection-org-setup)

(add-hook 'org-src-mode-hook #'evil-insert-state)
(add-hook 'org-mode-hook #'toggle-word-wrap)
(add-hook 'org-mode-hook #'toggle-truncate-lines)
#+END_SRC

In this config I use auto-tangling but it's not built-in feature. So I
need to add it.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'org-auto-tangle)
(require 'org-auto-tangle)

(add-hook 'org-mode-hook #'org-auto-tangle-mode)
#+END_SRC

When using [[https://github.com/fniessen/org-html-themes][this]] awesome HTML export setup I want my codeblock to be
properly highlighted. I need to setup [[https://github.com/hniksic/emacs-htmlize][htmlize]].

#+BEGIN_SRC emacs-lisp
(straight-use-package 'htmlize)
(require 'htmlize)
#+END_SRC

Snippets (~templates.eld~):

#+BEGIN_SRC lisp-data :tangle templates.eld
org-mode

(src "#+BEGIN_SRC " (s lang) n>
     r> n>
     "#+END_SRC")

(elisp "#+BEGIN_SRC emacs-lisp" n>
       r> n>
       "#+END_SRC")

(shell "#+BEGIN_SRC shell" n>
       r> n>
       "#+END_SRC")

(snip "#+BEGIN_SRC lisp-data :tangle templates.eld" n>
      r> n>
      "#+END_SRC")
#+END_SRC

** Markdown
Markdown is (the most?) popular format for technical documentation.

I want to have idirect editing of code blocks like in org-mode. So I
need to install ~edit-indirect~ package as stated in ~markdown-mode~
README.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'edit-indirect)
(require 'edit-indirect)
#+END_SRC

And now we can setup [[https://github.com/jrblevin/markdown-mode][markdown-mode]]:

#+BEGIN_SRC emacs-lisp
(straight-use-package 'markdown-mode)
(setq markdown-fontify-code-blocks-natively t)
(require 'markdown-mode)

(add-to-list 'auto-mode-alist
             `(,(rx "README.md" eos) . gfm-mode))
#+END_SRC

Some of my projects have a really big README file so I need
[[https://github.com/ardumont/markdown-toc/][markdown-toc]] in order to generate a table of contents.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'markdown-toc)
(setq markdown-toc-indentation-space 2)
(require 'markdown-toc)
#+END_SRC

Last but not least - mode-specific keybindings:

#+BEGIN_SRC emacs-lisp
(my-leader-def
  :keymaps 'markdown-mode-map
  :major-modes t
  "m" '(:ignore t :which-key "markdown")
  "m t" '(:ignore t :which-key "toggle")
  "m t t" #'markdown-toggle-markup-hiding
  "m t s" #'markdown-toggle-fontify-code-blocks-natively
  "m t i" #'markdown-toggle-inline-images
  "m t m" #'markdown-toggle-math
  "m t u" #'markdown-toggle-url-hiding
  "m t w" #'markdown-toggle-wiki-links
  "m T" #'markdown-toc-generate-or-refresh-toc
  "m P" #'plantuml-preview-current-block)
#+END_SRC

