README.html
<div id="outline-container-orgec484d4" class="outline-3">
<h3 id="orgec484d4"><span class="section-number-3">3.4.</span> Ruby</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<a href="https://www.ruby-lang.org/en/">Ruby</a> was my favorite programming language before Elixir. I still use
it, like it and need to have a good support for it.
</p>

<p>
Unfortunately <code>ruby-mode</code> still has better syntax highlighting then
<code>ruby-ts-mode</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">ruby-mode</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'ruby-mode-hook #'eglot-ensure<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Support for RSpec and Minitest are essential.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'rspec-mode<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">rspec-mode</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>straight-use-package 'minitest<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">minitest</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Language-specific leader keybindings:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #81A1C1;">:keymaps</span> 'ruby-mode-map
  <span style="color: #81A1C1;">:major-modes</span> t
  <span style="color: #A3BE8C;">"m"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"ruby"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"m t"</span> #'rspec-mode-keymap
  <span style="color: #A3BE8C;">"m m"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"minitest"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"m m v"</span> #'minitest-verify
  <span style="color: #A3BE8C;">"m m s"</span> #'minitest-verify-single
  <span style="color: #A3BE8C;">"m m t"</span> #'minitest-toggle-test-and-target
  <span style="color: #A3BE8C;">"m m r"</span> #'minitest-rerun
  <span style="color: #A3BE8C;">"m m a"</span> #'minitest-verify-all<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1e9d8bf" class="outline-3">
<h3 id="org1e9d8bf"><span class="section-number-3">3.5.</span> JSON</h3>
<div class="outline-text-3" id="text-3-5">
<p>
JSON files are everywhere! I prefer to use tree-sitter-based mode
instead of built-in <code>js-json-mode</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>add-to-list 'major-mode-remap-alist '<span style="color: #88C0D0;">(</span>js-json-mode . json-ts-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1bd2e8e" class="outline-3">
<h3 id="org1bd2e8e"><span class="section-number-3">3.6.</span> YAML</h3>
<div class="outline-text-3" id="text-3-6">
<p>
YAML files are everywhere too! I prefer to use built-in
tree-sitter-based mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>add-to-list 'auto-mode-alist `<span style="color: #88C0D0;">(</span>,<span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">rx</span> <span style="color: #A3BE8C;">".ya"</span> <span style="color: #5E81AC;">(</span>? <span style="color: #A3BE8C;">"m"</span><span style="color: #5E81AC;">)</span> <span style="color: #A3BE8C;">"l"</span> eos<span style="color: #81A1C1;">)</span> . yaml-ts-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgff20be5" class="outline-3">
<h3 id="orgff20be5"><span class="section-number-3">3.7.</span> ORG</h3>
<div class="outline-text-3" id="text-3-7">
<p>
<a href="https://orgmode.org/">Org-mode</a> is the decent way to write notes, documentation and even this
config. It's already loaded earlier in this document so here I just
tailor it to my needs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> org-startup-indented t
      org-src-preserve-indentation t
      org-html-head-include-scripts nil
      org-pretty-entities t<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>evil-collection-org-setup<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'org-src-mode-hook #'evil-insert-state<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'org-mode-hook #'toggle-word-wrap<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-hook 'org-mode-hook #'toggle-truncate-lines<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
In this config I use auto-tangling but it's not built-in feature. So I
need to add it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'org-auto-tangle<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">org-auto-tangle</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'org-mode-hook #'org-auto-tangle-mode<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
When using <a href="https://github.com/fniessen/org-html-themes">this</a> awesome HTML export setup I want my codeblock to be
properly highlighted. I need to setup <a href="https://github.com/hniksic/emacs-htmlize">htmlize</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'htmlize<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">htmlize</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Snippets (<code>templates.eld</code>):
</p>

<div class="org-src-container">
<pre class="src src-lisp-data">org-mode

(src <span style="color: #A3BE8C;">"#+BEGIN_SRC "</span> (s lang) n&gt;
     r&gt; n&gt;
     <span style="color: #A3BE8C;">"#+END_SRC"</span>)

(elisp <span style="color: #A3BE8C;">"#+BEGIN_SRC emacs-lisp"</span> n&gt;
       r&gt; n&gt;
       <span style="color: #A3BE8C;">"#+END_SRC"</span>)

(shell <span style="color: #A3BE8C;">"#+BEGIN_SRC shell"</span> n&gt;
       r&gt; n&gt;
       <span style="color: #A3BE8C;">"#+END_SRC"</span>)

(snip <span style="color: #A3BE8C;">"#+BEGIN_SRC lisp-data :tangle templates.eld"</span> n&gt;
      r&gt; n&gt;
      <span style="color: #A3BE8C;">"#+END_SRC"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc37dca5" class="outline-3">
<h3 id="orgc37dca5"><span class="section-number-3">3.8.</span> Markdown</h3>
<div class="outline-text-3" id="text-3-8">
<p>
Markdown is (the most?) popular format for technical documentation.
</p>

<p>
I want to have idirect editing of code blocks like in org-mode. So I
need to install <code>edit-indirect</code> package as stated in <code>markdown-mode</code>
README.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'edit-indirect<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">edit-indirect</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
And now we can setup <a href="https://github.com/jrblevin/markdown-mode">markdown-mode</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'markdown-mode<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> markdown-fontify-code-blocks-natively t<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">markdown-mode</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-to-list 'auto-mode-alist
             `<span style="color: #88C0D0;">(</span>,<span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">rx</span> <span style="color: #A3BE8C;">"README.md"</span> eos<span style="color: #81A1C1;">)</span> . gfm-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Some of my projects have a really big README file so I need
<a href="https://github.com/ardumont/markdown-toc/">markdown-toc</a> in order to generate a table of contents.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'markdown-toc<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> markdown-toc-indentation-space 2<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">markdown-toc</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Last but not least - mode-specific keybindings:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #81A1C1;">:keymaps</span> 'markdown-mode-map
  <span style="color: #81A1C1;">:major-modes</span> t
  <span style="color: #A3BE8C;">"m"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"markdown"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"m t"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"toggle"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"m t t"</span> #'markdown-toggle-markup-hiding
  <span style="color: #A3BE8C;">"m t s"</span> #'markdown-toggle-fontify-code-blocks-natively
  <span style="color: #A3BE8C;">"m t i"</span> #'markdown-toggle-inline-images
  <span style="color: #A3BE8C;">"m t m"</span> #'markdown-toggle-math
  <span style="color: #A3BE8C;">"m t u"</span> #'markdown-toggle-url-hiding
  <span style="color: #A3BE8C;">"m t w"</span> #'markdown-toggle-wiki-links
  <span style="color: #A3BE8C;">"m T"</span> #'markdown-toc-generate-or-refresh-toc
  <span style="color: #A3BE8C;">"m P"</span> #'plantuml-preview-current-block<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
