README.org
** Docker
It's hard to avoid [[https://www.docker.com/][Docker]] in modern development. Unfortunately. So I
need Dockerfile support and prefer to use tree-sitter-based solution.

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist
             (cons (rx (any "/\\")
                       (or "Containerfile" "Dockerfile")
                       (opt "."
                            (zero-or-more
                             (not (any "/\\"))))
                       eos)
                   'dockerfile-ts-mode))

(add-to-list 'auto-mode-alist `(,(rx ".dockerfile" eos) . dockerfile-ts-mode))

(add-hook 'dockerfile-ts-mode-hook #'eglot-ensure)
#+END_SRC

Also it's convinient to have a way to inspect Docker containers and
images using some EMACS UI.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'docker)
(require 'docker)

(evil-collection-docker-setup)

(my-leader-def
  "a d" #'docker)
#+END_SRC

** Earthly
[[https://earthly.dev/][Earthly]] is a modern mix of Make and Docker. I used it in some of my
projects.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'earthfile-mode)
(require 'earthfile-mode)
#+END_SRC

** Terrafrom
[[https://www.terraform.io/][Terraform]] is my favourite "infrastructure as code" tool.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'terraform-mode)
(require 'terraform-mode)

(add-to-list 'eglot-server-programs
             '(terraform-mode . ("terraform-ls" "serve")))

(add-hook 'terraform-mode-hook #'eglot-ensure)
#+END_SRC

TODO: [[https://github.com/MichaHoffmann/tree-sitter-hcl][use tree-sitter-based mode]]

** Go
I can write [[https://go.dev/][Go]] code. And sometimes I need to do it. Built-in
tree-sitter-based modes are my choice.

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist
             `(,(rx ".go" eos) . go-ts-mode))
(add-to-list 'auto-mode-alist
             `(,(rx (any "/\\") "go.mod" eos) . go-mod-ts-mode))

(add-hook 'go-ts-mode-hook #'eglot-ensure)
#+END_SRC

I prefer to be able to run tests from EMACS.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'gotest)
(require 'gotest)
#+END_SRC

Language-specific leader keybindings:

#+BEGIN_SRC emacs-lisp
(my-leader-def
  :keymaps 'go-ts-mode-map
  :major-modes t
  "m" '(:ignore t :which-key "go")
  "m t" '(:ignore t :which-key "gotest")
  "m t v" #'go-test-current-file
  "m t s" #'go-test-current-test
  "m t a" #'go-test-current-project)
#+END_SRC

** Python
I can write Python. And sometimes I need to do it. Built-in
tree-sitter-based mode is my choice.

#+BEGIN_SRC emacs-lisp
(add-to-list 'major-mode-remap-alist '(python-mode . python-ts-mode))

(add-hook 'python-ts-mode-hook #'eglot-ensure)
#+END_SRC

** Mastodon
I want to try to use [[https://mastodon.social/explore][Mastodon]] because I don't like Twitter or Facebook
or Instagram etc. I believe that it's better to invest time in social
platforms that are not about ads and tracking.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'mastodon)
(setq mastodon-instance-url "https://genserver.social"
      mastodon-active-user "ffloyd")
(require 'mastodon)
#+END_SRC

Default timeline is not fancy enough for me.

#+BEGIN_SRC emacs-lisp
(straight-use-package '(mastodon-alt :type git :host github :repo "rougier/mastodon-alt"))
(require 'mastodon-alt)

(mastodon-alt-tl-activate)
#+END_SRC

