README.html
<div id="outline-container-orgd93c2bd" class="outline-3">
<h3 id="orgd93c2bd"><span class="section-number-3">3.9.</span> Docker</h3>
<div class="outline-text-3" id="text-3-9">
<p>
It's hard to avoid <a href="https://www.docker.com/">Docker</a> in modern development. Unfortunately. So I
need Dockerfile support and prefer to use tree-sitter-based solution.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>add-to-list 'auto-mode-alist
             <span style="color: #88C0D0;">(</span>cons <span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">rx</span> <span style="color: #5E81AC;">(</span>any <span style="color: #A3BE8C;">"/\\"</span><span style="color: #5E81AC;">)</span>
                       <span style="color: #5E81AC;">(</span><span style="color: #81A1C1;">or</span> <span style="color: #A3BE8C;">"Containerfile"</span> <span style="color: #A3BE8C;">"Dockerfile"</span><span style="color: #5E81AC;">)</span>
                       <span style="color: #5E81AC;">(</span>opt <span style="color: #A3BE8C;">"."</span>
                            <span style="color: #D08770;">(</span>zero-or-more
                             <span style="color: #EBCB8B;">(</span>not <span style="color: #A3BE8C;">(</span>any <span style="color: #A3BE8C;">"/\\"</span><span style="color: #A3BE8C;">)</span><span style="color: #EBCB8B;">)</span><span style="color: #D08770;">)</span><span style="color: #5E81AC;">)</span>
                       eos<span style="color: #81A1C1;">)</span>
                   'dockerfile-ts-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-to-list 'auto-mode-alist `<span style="color: #88C0D0;">(</span>,<span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">rx</span> <span style="color: #A3BE8C;">".dockerfile"</span> eos<span style="color: #81A1C1;">)</span> . dockerfile-ts-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'dockerfile-ts-mode-hook #'eglot-ensure<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Also it's convinient to have a way to inspect Docker containers and
images using some EMACS UI.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'docker<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">docker</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>evil-collection-docker-setup<span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #A3BE8C;">"a d"</span> #'docker<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga06b782" class="outline-3">
<h3 id="orga06b782"><span class="section-number-3">3.10.</span> Earthly</h3>
<div class="outline-text-3" id="text-3-10">
<p>
<a href="https://earthly.dev/">Earthly</a> is a modern mix of Make and Docker. I used it in some of my
projects.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'earthfile-mode<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">earthfile-mode</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd940d63" class="outline-3">
<h3 id="orgd940d63"><span class="section-number-3">3.11.</span> Terrafrom</h3>
<div class="outline-text-3" id="text-3-11">
<p>
<a href="https://www.terraform.io/">Terraform</a> is my favourite "infrastructure as code" tool.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'terraform-mode<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">terraform-mode</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-to-list 'eglot-server-programs
             '<span style="color: #88C0D0;">(</span>terraform-mode . <span style="color: #81A1C1;">(</span><span style="color: #A3BE8C;">"terraform-ls"</span> <span style="color: #A3BE8C;">"serve"</span><span style="color: #81A1C1;">)</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'terraform-mode-hook #'eglot-ensure<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
TODO: <a href="https://github.com/MichaHoffmann/tree-sitter-hcl">use tree-sitter-based mode</a>
</p>
</div>
</div>
<div id="outline-container-orgd25a69d" class="outline-3">
<h3 id="orgd25a69d"><span class="section-number-3">3.12.</span> Go</h3>
<div class="outline-text-3" id="text-3-12">
<p>
I can write <a href="https://go.dev/">Go</a> code. And sometimes I need to do it. Built-in
tree-sitter-based modes are my choice.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>add-to-list 'auto-mode-alist
             `<span style="color: #88C0D0;">(</span>,<span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">rx</span> <span style="color: #A3BE8C;">".go"</span> eos<span style="color: #81A1C1;">)</span> . go-ts-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span>add-to-list 'auto-mode-alist
             `<span style="color: #88C0D0;">(</span>,<span style="color: #81A1C1;">(</span><span style="color: #81A1C1;">rx</span> <span style="color: #5E81AC;">(</span>any <span style="color: #A3BE8C;">"/\\"</span><span style="color: #5E81AC;">)</span> <span style="color: #A3BE8C;">"go.mod"</span> eos<span style="color: #81A1C1;">)</span> . go-mod-ts-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'go-ts-mode-hook #'eglot-ensure<span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
I prefer to be able to run tests from EMACS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'gotest<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">gotest</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Language-specific leader keybindings:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">my-leader-def</span>
  <span style="color: #81A1C1;">:keymaps</span> 'go-ts-mode-map
  <span style="color: #81A1C1;">:major-modes</span> t
  <span style="color: #A3BE8C;">"m"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"go"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"m t"</span> '<span style="color: #88C0D0;">(</span><span style="color: #81A1C1;">:ignore</span> t <span style="color: #81A1C1;">:which-key</span> <span style="color: #A3BE8C;">"gotest"</span><span style="color: #88C0D0;">)</span>
  <span style="color: #A3BE8C;">"m t v"</span> #'go-test-current-file
  <span style="color: #A3BE8C;">"m t s"</span> #'go-test-current-test
  <span style="color: #A3BE8C;">"m t a"</span> #'go-test-current-project<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9c4f710" class="outline-3">
<h3 id="org9c4f710"><span class="section-number-3">3.13.</span> Python</h3>
<div class="outline-text-3" id="text-3-13">
<p>
I can write Python. And sometimes I need to do it. Built-in
tree-sitter-based mode is my choice.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>add-to-list 'major-mode-remap-alist '<span style="color: #88C0D0;">(</span>python-mode . python-ts-mode<span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>add-hook 'python-ts-mode-hook #'eglot-ensure<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc77023e" class="outline-3">
<h3 id="orgc77023e"><span class="section-number-3">3.14.</span> Mastodon</h3>
<div class="outline-text-3" id="text-3-14">
<p>
I want to try to use <a href="https://mastodon.social/explore">Mastodon</a> because I don't like Twitter or Facebook
or Instagram etc. I believe that it's better to invest time in social
platforms that are not about ads and tracking.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package 'mastodon<span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">setq</span> mastodon-instance-url <span style="color: #A3BE8C;">"https://genserver.social"</span>
      mastodon-active-user <span style="color: #A3BE8C;">"ffloyd"</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">mastodon</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>

<p>
Default timeline is not fancy enough for me.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8FBCBB;">(</span>straight-use-package '<span style="color: #88C0D0;">(</span>mastodon-alt <span style="color: #81A1C1;">:type</span> git <span style="color: #81A1C1;">:host</span> github <span style="color: #81A1C1;">:repo</span> <span style="color: #A3BE8C;">"rougier/mastodon-alt"</span><span style="color: #88C0D0;">)</span><span style="color: #8FBCBB;">)</span>
<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">mastodon-alt</span><span style="color: #8FBCBB;">)</span>

<span style="color: #8FBCBB;">(</span>mastodon-alt-tl-activate<span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
